{
  "US": {
    "ios": {
      "top_grossing": {
        "Royal Match": {
          "version": "32131",
          "updated": "2025-10-27T08:01:19Z",
          "releaseNotes": "Are you ready for a spooky new update?\n\n• Get ready for amazing 100 NEW LEVELS! Hit the CLOCK TOWER and watch the GEARS burst onto the board!\n\n• Explore the NEW AREA! Stock up on scares and sweets in the HALLOWEEN SHOP!\n\nNew levels are coming in every two weeks! Be sure to update your game to get the latest content!",
          "app_id": "1482155847"
        },
        "MONOPOLY GO!": {
          "version": "1.56.1",
          "updated": "2025-10-17T15:58:34Z",
          "releaseNotes": "Feeling cozy, Tycoon?\nA new Sticker album is now live — time to get ready to collect, trade, and complete your set!\nBugs swept off the board\nTournaments tuned for smoother play\nGameplay touched up for a better experience\nUpdate now and stay ahead of the game!",
          "app_id": "1621328561"
        },
        "Last War:Survival": {
          "version": "1.0.316",
          "updated": "2025-10-23T09:29:11Z",
          "releaseNotes": "1. Optimized the text display for offline time in the Alliance member list.\n2. Optimized the maximum zoom ratio for maps in teleport mode and adapted the top layout display effects for some devices during zooming.",
          "app_id": "6448786147"
        },
        "Candy Crush Saga": {
          "version": "1.314.1.1",
          "updated": "2025-10-27T07:10:20Z",
          "releaseNotes": "We hope you’re having fun playing Candy Crush Saga! \n\nWe update the game every week with sweet new features, exciting levels, and important bug fixes to keep everything running smoothly. \n\nDon't forget to download the latest version for the best experience!\n\nNew to the game? Don’t be shy, join the fun!",
          "app_id": "553834731"
        },
        "Clash Royale": {
          "version": "12.169.18",
          "updated": "2025-10-17T07:22:03Z",
          "releaseNotes": "New update: CLASH-O-WEEN IS BACK!\n• NEW EVOLUTIONS:\n• Skeleton Army – A General rises to lead the swarm.\n• Royal Ghost – Summons Souldiers to fight by his side.\n• NEW LUCKY CHESTS: Special Chests packed with seasonal content - Cards, Cosmetics, and Evolution Shards.\n• MERGE TACTICS: New Rulers enter the Arena and the roster expands with powerful Troops like Wizard, Witch, Electro Wizard, and more.\n• Plus, bug fixes and improvements to keep battles running smoothly",
          "app_id": "1053012308"
        },
        "Kingshot": {
          "version": "1.7.12",
          "updated": "2025-10-28T07:10:55Z",
          "releaseNotes": "[New Content]\n1. New Feature: Mystic Trial. A brand-new adventure awaits! \n2. New Feature: Leading Glory. During Kingdom Transfer, your Kingdom will receive a Leading Emblem each time it qualifies as a Leading Kingdom. Accumulate Leading Emblems to unlock special Leading Glory skins. Show off your Kingdom's dominance!\n3. New Feature: Mood Status. Set a status to let others know how you're feeling, making social interactions more fun and personal.",
          "app_id": "6739554056"
        },
        "Pokémon GO": {
          "version": "0.385.0",
          "updated": "2025-10-27T17:23:13Z",
          "releaseNotes": "Trainers, we hope you’re enjoying your adventure in Pokémon GO! We update the app regularly with new events and features, so make sure to check the in-game News to stay up to date.",
          "app_id": "1094591345"
        },
        "Whiteout Survival": {
          "version": "1.28.18",
          "updated": "2025-10-22T07:06:00Z",
          "releaseNotes": "[New Content]\n1. New Feature: Tundra Album. Forge your legend in the icy realm! Gather Scene Fragments scattered across the tundra. And piece them together into spectacular scenes. Relive the timeless legends of the frost-bound era and make history yourself!\n2. New Feature: Leading Glory system. Each time your state qualifies as a Leading State during State Transfer, it will receive a Leading Emblem. The Leading Emblems can be used to unlock exclusive rewards such as Sunfire Castle Shield Skin, State Transfer Event State Name Card, Sunfire Castle Skin and Turret Skin, and Exclusive State Title. Stay proud of your state!\n3. New Event: Dead Shot When participating in regular events, you have a chance of earning \"Shotchits\". You can use the \"Shotchits\" to play a shooting game. Hit the bullseye for bountiful rewards! Every 2 \"Chest Keys\" collected can be used to open a chest that contains extra bonuses. By spending enough Shotchits, you can unlock the exclusive Action Emote: Hit!\n\n[Optimization & Adjustment]\n1. Bear Hunt: Added the Auto-Register feature, which automatically starts a Bear Hunt based on the last opening time once the cooldown ends.\n2. Castle Battle: Reduced the battle duration to 5 hours and the required occupation time for victory to 2.5 hours, without changing the battlefield opening hours.\n3. Daybreak Island: Added a new basic decoration, \"Marble Fence\". Introduced the Like History feature, allowing you to view likes from other Chiefs.\n4. Lighthouse Intel: Upon reaching Furnace Lv. 15 or VIP Lv. 5, you will unlock the \"Claim All\" feature for claiming your Intel rewards.\n5. Alliance Championship: Added the \"Batch-Adjust\" feature to the troop info page, allowing R4 or higher officers to adjust lanes more efficiently.\n6. Teleport: While using a \"Territory Teleporter\", you can freely adjust and select your target location before confirmation. If your target location is within your Alliance territory, \"Territory Teleporters\" will be used first.\n7. Snowbusters:\na. Increased Fuel consumption and rewards for snow clearing (numerical adjustments only without changing the overall rewards). After a certain levels, monsters in an area can drop multiple Snowbuster Maps.\nb. Added a feature that allows you to exchange Fuel for Rockets after clearing Area 16.\nc. Added the Raid feature, which becomes available once you reach Area 24. You will be able to clear stages quickly by spending Fuel.\nd. Snowbusters Pass Optimization: Using Rockets now grants Snow Points. \n8. Chief Gear: When your state age reaches a certain number of days, we will introduce T4 Legendary Gear (3-Star) and expand the sources for Chief Gear enhancement materials. The details are as follows:\na. Labyrinth Shop: \"Chief Gear Materials Chest\" will become available.\nb. Alliance Championship Shop: The weekly purchase limit for \"Polishing Solution\", \"Design Plan\", and \"Hardened Alloy\" will be increased.\nc. Crazy Joe: Personal Ranking Rewards and Alliance Ranking Rewards will be updated.\n9. Frostdragon Tyrant: Introduced State Rewards for all Chiefs at Furnace Lv. 20 or higher in the states of the top 10 Chiefs on the Occupation Ranking. Additionally, the Tyrant’s Gift will now appear at a random location near the Sunfire Castle instead of a fixed position.\n10. Tundra Arms League: Introduced rank-determined State Rewards for all Chiefs at Furnace Lv. 20 or higher in the states of the top 4 Legions, which can be claimed manually.\n11. Foundry Battle: After occupying a building for 30 minutes in Foundry Battle and Tundra Arms League, you will gain Personal Points much faster.\n12. Mercenary Prestige: When your state unlocks Fire Crystal Lv. 8, a new type of Legend's Initiation will be introduced, and the current one will be renamed as Epic Initiation.\n13. The Labyrinth: Introduced the Alliance Member Leaderboard, allowing you to view your allies' performances.",
          "app_id": "6443575749"
        },
        "Gossip Harbor®: Merge & Story": {
          "version": "3.76.0",
          "updated": "2025-10-22T11:03:36Z",
          "releaseNotes": "NEW EPISODE EVERY FRIDAY!\n- NEW EPISODE: With new chapter updates every Friday; follow Quinn as she exposes secrets and solves puzzles.\n- NEW EVENT:Visit the Dark Zone and unlock the Howling Factory! Join Sam, Colton and Harrison as they're transported to a strange nightmare world. Help them escape by collecting points and unlock exclusive decorations to complete the event.",
          "app_id": "1623318294"
        },
        "Royal Kingdom": {
          "version": "22800",
          "updated": "2025-10-20T07:59:51Z",
          "releaseNotes": "Play Royal Kingdom now!Get ready for a gorgeous new update!\n\n• Prepare yourself for 100 NEW LEVELS! Experience fun and exciting challenges!\n\n• Unlock the latest item, MOSAIC TILES! When the tiles start to crack, what’s beneath comes right back!\n\n• Defeat the new enemy, CACTUS! Looks like it’s gone for a while, then it pops up on another tile!\n\n• Partner up for the new event, HIDDEN PATH! Prove that teamwork’s might can quell the Dark Witch’s spell!\n\n• Explore the new district, MONORAIL! Keep expanding the kingdom to discover new horizons!\n\nPlay Royal Kingdom now!",
          "app_id": "1606549505"
        },
        "Township": {
          "version": "31.0.0",
          "updated": "2025-10-14T10:15:05Z",
          "releaseNotes": "Get ready for a new update!\nNew adventures in Township!\n\nSeason Adventures\n* Gatsby-era fashion and medieval nobility are coming to Township! Decorate your town and win valuable resources in the Gatsby Pass and Knight Pass!\n\nThrilling new expeditions\n* While searching for traces of Vikings, Richard and Rachel end up captured by them and must fight off a mysterious monster!\n* Richard, Ellen, and Alicia take part in filming an exciting Thanksgiving TV show!\n\nNew card collection\n* Collect cards from the Winter Collection to get a unique badge and other prizes!\n\nAlso\n* Halloween and Black Friday sales\n* Travel to Loch Ness and Santa's home in new regatta seasons!\n* Enjoy new buildings—a yoga center and a spiral complex!",
          "app_id": "638689075"
        },
        "Last Z: Survival Shooter": {
          "version": "1.250.682",
          "updated": "2025-10-23T07:21:09Z",
          "releaseNotes": "bugs fixed.",
          "app_id": "6503272652"
        },
        "Toon Blast": {
          "version": "19991",
          "updated": "2025-10-27T08:01:00Z",
          "releaseNotes": "PLAY 50 NEW LEVELS!\nToon Blast introduces the Candy Crew episode with 50 new levels!\nBe sure to update to the current version of Toon Blast for the newest content.\nCome and join the fun!",
          "app_id": "1176027022"
        },
        "Coin Master": {
          "version": "3.5.2290",
          "updated": "2025-10-27T07:55:07Z",
          "releaseNotes": "Thanks for playing Coin Master!\n\nIn this version, we’ve implemented bug fixes & performance improvements.\n\nWe have also implemented our new reward calendar feature - collect your daily rewards! \n\nEnjoy a world of fun, thrills, and huge rewards right at your fingertips. \n\nInvite your friends to play Coin Master & get your FREE REWARDS! We also recommend joining our community on Facebook, Twitter, and Instagram for more fun & excitement.\n\nEnjoying Coin Master? Leave a review :)",
          "app_id": "406889139"
        },
        "Match Factory!": {
          "version": "1.53.41",
          "updated": "2025-10-20T07:08:45Z",
          "releaseNotes": "• NEW PACK: Tropical Fruits\n\nNew items are coming every 2 weeks! Be sure to update your game to get the latest content!",
          "app_id": "6449094229"
        },
        "Gardenscapes": {
          "version": "9.1.0",
          "updated": "2025-10-03T13:08:16Z",
          "releaseNotes": "A fall Gardenscapes update!\nNEW EVENTS\nLegends of Transylvania: find the missing girls and complete a horror quest!\nScourge of the Seas: embark on a real pirate adventure for treasure!\n\nSTORYLINE\nFind out what Bill Young's parents were secretly working on at their oceanographic station!",
          "app_id": "1105855019"
        },
        "Homescapes": {
          "version": "8.3.6",
          "updated": "2025-10-23T09:04:00Z",
          "releaseNotes": "Get ready for a thrilling Homescapes update!\n \nHALLOWEEN: A NIGHT IN THE WOODS\n• Help Robbie find his daughter Chloe in the nighttime forest!\n• Uncover the mystery of the sinister masked figure!\n• Finish the event to earn a unique decoration!\n \nTHE FRONTIER'S GOLD\n• Learn the story of Austin's great-grandmother, the fearless Marshal Goldy!\n• Foil the local bandits' plans and be the first to claim the legendary treasures!\n• Finish the event to earn a unique decoration!\n \nALSO\n• Spooky Pass and Home Pass! Activate the passes to get coins, boosters, and other valuable rewards!\n• The Other Half story continues! Who will Katherine choose?",
          "app_id": "1195621598"
        },
        "Free Fire x NARUTO SHIPPUDEN": {
          "version": "1.118.1",
          "updated": "2025-10-29T03:30:18Z",
          "releaseNotes": "[Flame Arena] Step into the inferno as the flames close in. The strongest will claim victory.\n[New Loadouts] 4 fresh loadouts to mix and match for ultimate team strategy.\n[New Character - Nero] Be careful not to enter and get lost in the dream space this dreamsmith creates.\n[New Weapon - Winchester] A full-auto marksman rifle with 2-round firing and high mobility, an excellent pick for long‑range combat.\n[Social Island in Custom Room] Create your own hangout and invite friends to party together.",
          "app_id": "1300146617"
        },
        "Travel Town - Merge Adventure": {
          "version": "2.12.1280",
          "updated": "2025-10-19T12:36:34Z",
          "releaseNotes": "Welcome to the latest update of Travel Town!\nWe’ve been busy improving the game and addressing bugs for you. \nEnjoy!",
          "app_id": "1521236603"
        },
        "Dark War:Survival": {
          "version": "1.250.619",
          "updated": "2025-10-24T09:55:34Z",
          "releaseNotes": "[Adjustments & Optimizations]\n\n[State of Supremacy]\n- Points adjustment during the Invasion Right contest phase\nBefore: Successfully seize the enemy State Dark Syndicate Truck once\nAfter: Escort an S-Tier Dark Syndicate Truck once (points awarded based on whether it is plundered).\n\n[Capital Clash]\nAdjustments for point acquisition ways: \n- Garrison the Capital\n- Garrison Turrets\n- Kill enemy units at the Capital\n- Suffer severe injuries or unit losses at the Capital\n- Kill units during turret battles\n- Suffer severe injuries or unit losses during turret battles\n\n[Territory Triumph]\n- Added the [Schedule War] feature. Alliance members can view scheduled information in the event interface.\n- Once the scheduled time is reached, the war will automatically start.\n- Cities with scheduled war plans can still be attacked immediately.\n\n[Zombie Siege]\n- When the event time conflicts with [Blood Moon Shroud], a secondary confirmation prompt will appear.\n- Each season will feature zombies with different themed appearances.\n\n[Other Improvements]\n- Chat channels now support recalling text and images sent within 2 minutes.\n- [Allied Power] now allows viewing of daily refreshable exclusive tasks.\n- After zooming the world map, survivors can still view the [Peace Shield] status of shelters.",
          "app_id": "6670441558"
        },
        "Love and Deepspace": {
          "version": "4.5.0",
          "updated": "2025-10-28T21:01:14Z",
          "releaseNotes": "Love and DeepSpace – New Version [Heartbeats Ablaze] is now open!\n\n[Brand New 5-Star Memories]\nThe limited-time event [Heartbeats Ablaze] is now open! Collect series Memories and, upon meeting certain conditions, receive an exclusive BGM for free. You can also earn rewards such as Deepspace Wish: Limited, Event Memory-Themed Outfit, and selectable Event-Limited 5-Star Memory and other Cumulative Wish Rewards!\n \n[Limited-Time Events]\n- The limited-time event [Evernit Meloride] is now open! Let the music guide you as you embark on a journey through the Polar Night City. Participate to receive Deepspace Wish: Limited, New Accessories, Photo Poses, Exclusive Title, Journal Items, and more rewards for Free!\n- The [Nightbeat Gift] event is now open! Claim multiple rewards for free, and unlock more valued packs for even greater bonuses. [Dazzle Decor Sets] are also available at a limited-time discount. Purchase the pack and enjoy your exclusive dazzling stage!\n- New Outfits will be available for a limited time on November 7, with last year's trendy costumes returning for a limited period. Don't miss this annual special: unlock a new outfit at a special price!\n \n[System Upgrades]\n- [Affinity] Cap Increase—more heartwarming moments with him are waiting to be unlocked!\n- [With Him - Decor] now features 3D preview functionality—revisit the unforgettable times you've shared together.\n- [Your Cat Misses You] widget now has dynamic expressions for more cute and heartwarming interactions.\n- Memory System search and sorting functions upgraded—easier, more precise filtering makes your Memories always within reach.",
          "app_id": "6443467666"
        },
        "Pokémon TCG Pocket": {
          "version": "1.4.0",
          "updated": "2025-10-29T01:00:40Z",
          "releaseNotes": "● Mega Rising: Mega Gyarados, Mega Rising: Mega Blaziken, and and Mega Rising: Mega Altaria booster packs are now available.\n● New share feature.\n● More cards eligible for trading.\n● Wonder pick feature updated.\n● Flair can now be obtained automatically.\n● Increased the number of decks you can build.\n● Player level max has been increased.\n● Improvements to some features.",
          "app_id": "6479970832"
        },
        "Evony": {
          "version": "5.10.3",
          "updated": "2025-10-22T04:58:55Z",
          "releaseNotes": "- Bug fixes and improvements",
          "app_id": "1098157959"
        },
        "Fishdom": {
          "version": "9.3.2",
          "updated": "2025-10-21T09:06:40Z",
          "releaseNotes": "Check out the latest Fishdom update!\nPIRATE GOLD AND THE POWER OF THE ELEMENTS!\n- Get tons of rewards and the Traveler's Badge by collecting all the cards in the Journey Collection!\n- Embark on the Black Mark expedition and solve the mystery of Captain Black's cursed doubloon!\n- Take on the challenges in the Thunder Spear expedition and appease Tlaloc and his furious thunderstorms!\nALSO\nNew aquarium: Treasure Island\nNew fish: Frontosa Cichlid and Rainbow Darter\nEnjoy the game!",
          "app_id": "664575829"
        },
        "Lightning Link Casino Slots": {
          "version": "9.5.0",
          "updated": "2025-10-09T11:18:44Z",
          "releaseNotes": "Thank you for playing Lightning Link Casino!\n\nNew amazing slots are on their way for you to enjoy! Stay tuned for more amazing events, seasons and coins to be won.\n\nWe hope you enjoy Lightning Link Casino!",
          "app_id": "1243005112"
        },
        "Age of Origins:Tower Defense": {
          "version": "1.3.803",
          "updated": "2025-10-24T02:49:48Z",
          "releaseNotes": "Optimized some of the game play.",
          "app_id": "1376515087"
        },
        "Call of Duty®: Mobile": {
          "version": "1.0.52",
          "updated": "2025-07-28T03:12:00Z",
          "releaseNotes": "Descend into uncharted depths with Call of Duty®: Mobile’s Season 7: Phantom Current! Unearth the secrets of the abyss and encounter CODM’s sixth Mythic Operator, Dark Shepherd, a special crossover with Girls’ Frontline, and a refreshed Legendary reward in the Secret Cache system. \n\nNew Mythic Dark Shepherd: \nUnleash darkness with the most sinister Mythic Operator yet, Dark Shepherd – Phantom. Wield the Epic Scythe and Legendary AS-VAL to dominate the lobby with forces from another dimension. With power coursing through your veins, every fight becomes a surge of unstoppable force. \n\nNew Secret Cache Reward: \nAnother Legendary weapon skin is landing in the Secret Cache system! Log in and play to start earning the RUS-79U – Mystical Lamp… before it vanishes in a puff of smoke—and no genie can bring it back. \n \nGirls’ Frontline: \nGirls’ Frontline deploys into Call of Duty®: Mobile in Season 7! Recruit an iconic T-Doll Operator and gear up with exclusive themed items. Complete the seasonal event to de-stress, reload, and reinforce your squad with free Girls’ Frontline rewards. \n\nNew Battle Passes:  \nSeason 7 brings an all-new Battle Pass and the opportunity to earn 50 tiers of free and premium rewards, including the new MG 82 weapon and Bomb Drone Scorestreak! Gear up and stay the course—more treasures await you in the Season 8 Battle Pass! \n\nNew Battle Pass Vaults:    \nFan-favorite Battle Passes are setting sail once again in the Vault for Seasons 7 and 8—don’t miss your chance to rearm with gear from past deployments! Season 7 brings Season 11: Ultimate Frontier (2022) and Season 7: Heat Wave (2023) back on deck. Hold steady—more cargo is charted for arrival in Season 8! \n\nMajor Gameplay Updates: \nSeason 7 shifts into high gear with all-new gameplay updates for a fresh dose of chaos! Get ready to burn rubber in Mini Mayhem, where you’ll zip around the map battling for first place in an RCXD. And for the first time ever, CODM Battle Royale gets its own Gulag—fight your way back from elimination in a gritty 1v1 showdown on ‘Isolated’. \n\nFrom deep-sea secrets to Mythic mayhem, Call of Duty®: Mobile Season 7: Phantom Current plunges you into a fresh experience. The current’s pulling you in—so gear up and dive headfirst into the action!",
          "app_id": "1287282214"
        },
        "Cashman Casino Slots Games": {
          "version": "3.78.0",
          "updated": "2025-10-27T10:36:33Z",
          "releaseNotes": "Hey Mr. Cashman fans!\nGet our NEW games in our latest update!\nFor the best experience and most FUN we’ve squashed bugs and optimized your game.\nBecome a fan today using the following link to get daily bonuses and updates:\nhttps://www.facebook.com/cashmancasino/",
          "app_id": "1123582513"
        },
        "Color Block Jam": {
          "version": "1.28.15",
          "updated": "2025-10-24T06:33:08Z",
          "releaseNotes": "New look, same fun! We’ve refreshed our shimmering new game icon, perfectly matching the sparkle and excitement of our new event — BLOCK HEIST! It brings shimmering Gold, Emerald, and Diamond blocks. Pass them through matching gates before time runs out and earn incredible rewards. Plan your moves, time your actions, and complete the heist before the blocks slip away. Are you up for the challenge? Don’t miss the new update!",
          "app_id": "6504332779"
        },
        "Umamusume: Pretty Derby": {
          "version": "1.9.20",
          "updated": "2025-10-26T22:00:15Z",
          "releaseNotes": "Minor bug fixed.",
          "app_id": "6480433538"
        },
        "Jackpot Party - Casino Slots": {
          "version": "5064.00",
          "updated": "2025-10-28T00:22:49Z",
          "releaseNotes": "Hey, partiers! Get ready to take your slot-playing journey to the next level with our newest update! Download the latest version today and dive into a brand new Jackpot Party experience, including new collectable feature Party Cards, and see where you rank with Leaderboards!",
          "app_id": "575980917"
        },
        "Total Battle: Strategy Game": {
          "version": "339.2.1086",
          "updated": "2025-10-23T06:45:02Z",
          "releaseNotes": "Bug fixes and stability improvements.\nWe would be happy to hear your feedback and suggestions. Please send them to support@totalbattle.com",
          "app_id": "1274132545"
        },
        "Clash of Clans": {
          "version": "17.477.13",
          "updated": "2025-10-23T10:22:37Z",
          "releaseNotes": "Rank Up!\n·   Multiplayer split! Join Tournaments and climb new Leagues in Ranked Battles, or duke it out in regular Battles without the risk of losing Trophies.\n·   Revenge is back, and it’s sweet! Attack players that raided your Village to get your resources back!\n·   Shields have switched up! Introducing Magic Shields that protect resources and Legend Shields that skip upcoming League Days.\n·   Other Changes: We’re reworking Spring Traps and removing Town Hall Weapon Levels.",
          "app_id": "529479190"
        },
        "NYT Games: Wordle & Crossword": {
          "version": "6.0.0",
          "updated": "2025-10-27T17:49:20Z",
          "releaseNotes": "This version contains improvements to keep you solving smoothly!                                                                               \n\nHave feedback? Email us. nytgames@nytimes.com",
          "app_id": "307569751"
        },
        "Disney Solitaire": {
          "version": "1.7.1",
          "updated": "2025-10-23T09:42:27Z",
          "releaseNotes": "Get ready for an amazing update!\n* Prepare for NEW levels!\n* Unlock NEW Disney characters!\n* Join the magic with NEW DISNEY FEATURES!\n* Enjoy performance improvements for a smoother gaming experience!\nPlay Disney Solitaire!",
          "app_id": "6475757306"
        },
        "Screwdom": {
          "version": "7.2.4",
          "updated": "2025-10-24T02:56:07Z",
          "releaseNotes": "New Event: Christmas Collection – Celebrate the holiday season! Collect festive items and unlock exclusive rewards!",
          "app_id": "6740043080"
        },
        "Star Wars™: Galaxy of Heroes": {
          "version": "0.37.2",
          "updated": "2025-10-14T20:00:20Z",
          "releaseNotes": "Hey, Galaxy of Heroes fans! This update includes some back-end optimizations and performance improvements. Have fun, and see you on the Holotables!",
          "app_id": "921022358"
        },
        "Candy Crush Soda Saga": {
          "version": "1.305.2",
          "updated": "2025-10-28T08:42:47Z",
          "releaseNotes": "Sodalicious! We update our game every week with exciting levels, improvements to the game, and fun new features. Download the latest version to check it out!\nJoining us after a break? Welcome back! New to the game? You’ll be a pro before you know it!\n\nWhat are you waiting for? Let’s play!",
          "app_id": "850417475"
        },
        "DoubleDown™ Casino Vegas Slots": {
          "version": "4.5.167",
          "updated": "2025-10-20T06:05:59Z",
          "releaseNotes": "Hi, DoubleDown fans!\n\nGet excited, new slots are on the way! This update includes routine maintenance and performance improvements so that the casino is in tip-top shape before our next slot launch.\n\nHappy Spinning!",
          "app_id": "485126024"
        },
        "Magic Sort!": {
          "version": "16.28",
          "updated": "2025-10-26T18:10:45Z",
          "releaseNotes": "Are you ready for a magical new update?\n\n-New 100 levels!\n-Bug Fixes & Improvements\n\nEnjoy!",
          "app_id": "6499209744"
        },
        "Top Heroes: Kingdom Saga": {
          "version": "1.78.12",
          "updated": "2025-10-27T08:02:37Z",
          "releaseNotes": "Season 3 “Eternal Night Pact” ignites with passion! Choose your faction of faith, complete missions to earn reputation, unlock powerful bonuses and unique trials! Join the pact, ignite your battle spirit, and forge your legend!",
          "app_id": "6450953550"
        },
        "Bingo Blitz™ - BINGO Games": {
          "version": "5.82.1",
          "updated": "2025-10-26T07:25:42Z",
          "releaseNotes": "Thank you for being part of the Bingo Blitz community! Discover new bingo rooms, in-game events, celebrations and above all: The BEST Bingo experience! Let's BinGo!",
          "app_id": "529996768"
        },
        "Quick Hit Slots - Vegas Casino": {
          "version": "3.64.02",
          "updated": "2025-10-24T14:08:38Z",
          "releaseNotes": "SUMMER IS STILL PUMPING over at Quick Hit Slots!\n• Our NEW COLLECTIONS season pits GOOD against EVIL!\n• Quick Hit’s BIRTHDAY PARTY is just around the corner!\n• Choose any WildBall in the Showroom with our MAGICAL WILD WILDBALL!\n• We are ready to have a big celebration this LABOR DAY - so join us!\n• SCRATCH CARDS are coming, are you ready to WIN BIG?\n \nDOWNLOAD & UPDATE NOW!",
          "app_id": "945621521"
        },
        "All in Hole: Black Hole Games": {
          "version": "5.1.4",
          "updated": "2025-10-23T06:18:11Z",
          "releaseNotes": "NEW PACKS WITH FRESH LEVELS!\n\nOct 27 – WITCH Pack: Brew Halloween magic with 100 spellbinding levels!  \nNov 10 – OUTDOOR Pack: Pitch tents, roast marshmallows & explore 100 camping-themed levels!  \nNov 24 – THANKSGIVING Pack: Celebrate the harvest in 100 festive and flavorful levels!\n\nAnd don’t miss the new TREASURE PASS season starting Nov 1!\n\nUpdate regularly so you never miss fresh levels, events & surprises!",
          "app_id": "6503284107"
        },
        "Puzzles & Survival": {
          "version": "4.0.195",
          "updated": "2025-10-15T12:19:13Z",
          "releaseNotes": "[New Hero] Economy Hero, Lilian, is here! \n[New Event] Experience a magical Halloween! \n[New Appearance] Check out the new Halloween-themed skins! \n[Optimizations and Upgrades] Changes to the Lucky Golden Egg, and various other optimizations!",
          "app_id": "1517980891"
        },
        "Tasty Travels: Merge Game": {
          "version": "41.0",
          "updated": "2025-10-27T02:52:53Z",
          "releaseNotes": "- Minor bug fixes and improvements",
          "app_id": "6471045672"
        },
        "Toy Blast": {
          "version": "22306",
          "updated": "2025-10-22T13:16:23Z",
          "releaseNotes": "Play 50 new levels to find the spookiest costume!\n\nTrick or treat, or an update!\nThe night is dark, the pumpkins are carved, and the costumes are ready for the Halloween! The toys are all dressed up and headed out for a night full of treats, tricks, and scary stories. Step into this spooky update and join the fun!\n\nBe sure to update the current version of Toy Blast for the newest content. Every 2 weeks, we bring 50 NEW LEVELS!\nCome and have fun!",
          "app_id": "890378044"
        },
        "Merge Cooking®": {
          "version": "1.14.0",
          "updated": "2025-10-22T02:24:05Z",
          "releaseNotes": "Welcome back, Chef!\nA new version of Merge Cooking is available!\nTo provide a better experience, we're working hard to optimize the game performance as well as bring you exciting content.\nWe hope you can enjoy the time playing!\nNew to the game? Don't worry. We've prepared step-by-step instructions to guide you through. Join us and have some fun.",
          "app_id": "1643509748"
        },
        "Triple Match 3D": {
          "version": "175.02",
          "updated": "2025-10-26T06:07:40Z",
          "releaseNotes": "Thanks for playing Triple Match 3D! This update brings festive Halloween and Thanksgiving content, along with various improvements and bug fixes. Make sure to keep your game up to date for the best experience. For any questions, please reach out to our support team from within the game.",
          "app_id": "1607122287"
        },
        "Big Fish Casino: Slots Games": {
          "version": "19.8.38",
          "updated": "2025-09-26T18:34:41Z",
          "releaseNotes": "CELEBRATE the start of AUTUMN! Exclusive sales and events are happening all month long!\n\n* NEW SLOTS! Fú Lún, Magic Spark, & Firecracker Fortunes!\n* BUG FIXES! We’re always on the lookout for pesky bugs and have also made some performance fixes.\n* FREEBIES! Check us out on Facebook & Instagram for daily FREE CHIPS, as well as important updates!",
          "app_id": "538212549"
        }
      },
      "top_free": {
        "X-Clash: Dare": {
          "version": "1.0.30",
          "updated": "2025-10-25T05:40:36Z",
          "releaseNotes": "[Optimizations]\n- Improved certain experiences in Clash of Kingdoms.\n- Coordinates in union mails can now be tapped to navigate directly.\n- Optimized translation texts for some languages.",
          "app_id": "6744812012"
        },
        "Clash Royale": {
          "version": "12.169.18",
          "updated": "2025-10-17T07:22:03Z",
          "releaseNotes": "New update: CLASH-O-WEEN IS BACK!\n• NEW EVOLUTIONS:\n• Skeleton Army – A General rises to lead the swarm.\n• Royal Ghost – Summons Souldiers to fight by his side.\n• NEW LUCKY CHESTS: Special Chests packed with seasonal content - Cards, Cosmetics, and Evolution Shards.\n• MERGE TACTICS: New Rulers enter the Arena and the roster expands with powerful Troops like Wizard, Witch, Electro Wizard, and more.\n• Plus, bug fixes and improvements to keep battles running smoothly",
          "app_id": "1053012308"
        },
        "Block Blast！": {
          "version": "6.4.5",
          "updated": "2025-10-27T02:11:11Z",
          "releaseNotes": "We’re always improving Block Blast! Turn on auto-updates to get the latest features.\n\nSuggestions? Email us: blockblast-support@hungrystudio.com\nFollow us on TikTok for updates: @blockblastofficial",
          "app_id": "1617391485"
        },
        "Word Search Explorer®": {
          "version": "1.122",
          "updated": "2025-09-23T12:49:59Z",
          "releaseNotes": "Bug fixes and performance boosts! Enjoy smoother gameplay and faster load times—dive right in!",
          "app_id": "1602508478"
        },
        "Foundation: Galactic Frontier": {
          "version": "1.0.15",
          "updated": "2025-10-22T21:35:27Z",
          "releaseNotes": "- A few bugs fixed.",
          "app_id": "6737595599"
        },
        "Magic Sort!": {
          "version": "16.28",
          "updated": "2025-10-26T18:10:45Z",
          "releaseNotes": "Are you ready for a magical new update?\n\n-New 100 levels!\n-Bug Fixes & Improvements\n\nEnjoy!",
          "app_id": "6499209744"
        },
        "Solitaire Associations: Words": {
          "version": "0.1.62",
          "updated": "2025-10-21T10:17:36Z",
          "releaseNotes": "We are ready to make your game experience even greater. \nBugs are fixed and game performance is optimized. \nEnjoy.",
          "app_id": "6748950306"
        },
        "Chaos Zero Nightmare": {
          "version": "1.0.203",
          "updated": "2025-10-21T07:00:00Z",
          "releaseNotes": "Bug fixes and improvements",
          "app_id": "6502326151"
        },
        "Township": {
          "version": "31.0.0",
          "updated": "2025-10-14T10:15:05Z",
          "releaseNotes": "Get ready for a new update!\nNew adventures in Township!\n\nSeason Adventures\n* Gatsby-era fashion and medieval nobility are coming to Township! Decorate your town and win valuable resources in the Gatsby Pass and Knight Pass!\n\nThrilling new expeditions\n* While searching for traces of Vikings, Richard and Rachel end up captured by them and must fight off a mysterious monster!\n* Richard, Ellen, and Alicia take part in filming an exciting Thanksgiving TV show!\n\nNew card collection\n* Collect cards from the Winter Collection to get a unique badge and other prizes!\n\nAlso\n* Halloween and Black Friday sales\n* Travel to Loch Ness and Santa's home in new regatta seasons!\n* Enjoy new buildings—a yoga center and a spiral complex!",
          "app_id": "638689075"
        },
        "Roblox": {
          "version": "2.696.799",
          "updated": "2025-10-27T16:21:46Z",
          "releaseNotes": "To make Roblox work better for you, we deliver updates regularly. These updates include bug fixes and improvements for speed and reliability.",
          "app_id": "431946152"
        },
        "Vita Mahjong": {
          "version": "2.63.0",
          "updated": "2025-10-27T02:44:42Z",
          "releaseNotes": "-Bug fixes and performance improvements.",
          "app_id": "6468921495"
        },
        "Fortnite": {
          "version": "37.51",
          "updated": "2025-10-22T08:11:17Z",
          "releaseNotes": "General Bug & Stability Fixes",
          "app_id": "6483539426"
        },
        "Royal Kingdom": {
          "version": "22800",
          "updated": "2025-10-20T07:59:51Z",
          "releaseNotes": "Play Royal Kingdom now!Get ready for a gorgeous new update!\n\n• Prepare yourself for 100 NEW LEVELS! Experience fun and exciting challenges!\n\n• Unlock the latest item, MOSAIC TILES! When the tiles start to crack, what’s beneath comes right back!\n\n• Defeat the new enemy, CACTUS! Looks like it’s gone for a while, then it pops up on another tile!\n\n• Partner up for the new event, HIDDEN PATH! Prove that teamwork’s might can quell the Dark Witch’s spell!\n\n• Explore the new district, MONORAIL! Keep expanding the kingdom to discover new horizons!\n\nPlay Royal Kingdom now!",
          "app_id": "1606549505"
        },
        "MONOPOLY GO!": {
          "version": "1.56.1",
          "updated": "2025-10-17T15:58:34Z",
          "releaseNotes": "Feeling cozy, Tycoon?\nA new Sticker album is now live — time to get ready to collect, trade, and complete your set!\nBugs swept off the board\nTournaments tuned for smoother play\nGameplay touched up for a better experience\nUpdate now and stay ahead of the game!",
          "app_id": "1621328561"
        },
        "Sorry! World - Board Game": {
          "version": "0.24.0",
          "updated": "2025-10-26T02:09:07Z",
          "releaseNotes": "Sorry! World Update: Get Lucky & Invite Your Buddies! \nWe've got two awesome new features to share with you:\n\nLucky Cards: Feeling lucky? Now you can send and receive Lucky Cards with your Facebook friends!\nInvite-O-Meter: Got friends? Invite them to Sorry! World and get showered with gems and exclusive cosmetics!\nBug Fixes: We've been hard at work squashing bugs and optimizing performance! Enjoy a smoother, more stable Sorry! World!",
          "app_id": "6749000283"
        },
        "Whiteout Survival": {
          "version": "1.28.18",
          "updated": "2025-10-22T07:06:00Z",
          "releaseNotes": "[New Content]\n1. New Feature: Tundra Album. Forge your legend in the icy realm! Gather Scene Fragments scattered across the tundra. And piece them together into spectacular scenes. Relive the timeless legends of the frost-bound era and make history yourself!\n2. New Feature: Leading Glory system. Each time your state qualifies as a Leading State during State Transfer, it will receive a Leading Emblem. The Leading Emblems can be used to unlock exclusive rewards such as Sunfire Castle Shield Skin, State Transfer Event State Name Card, Sunfire Castle Skin and Turret Skin, and Exclusive State Title. Stay proud of your state!\n3. New Event: Dead Shot When participating in regular events, you have a chance of earning \"Shotchits\". You can use the \"Shotchits\" to play a shooting game. Hit the bullseye for bountiful rewards! Every 2 \"Chest Keys\" collected can be used to open a chest that contains extra bonuses. By spending enough Shotchits, you can unlock the exclusive Action Emote: Hit!\n\n[Optimization & Adjustment]\n1. Bear Hunt: Added the Auto-Register feature, which automatically starts a Bear Hunt based on the last opening time once the cooldown ends.\n2. Castle Battle: Reduced the battle duration to 5 hours and the required occupation time for victory to 2.5 hours, without changing the battlefield opening hours.\n3. Daybreak Island: Added a new basic decoration, \"Marble Fence\". Introduced the Like History feature, allowing you to view likes from other Chiefs.\n4. Lighthouse Intel: Upon reaching Furnace Lv. 15 or VIP Lv. 5, you will unlock the \"Claim All\" feature for claiming your Intel rewards.\n5. Alliance Championship: Added the \"Batch-Adjust\" feature to the troop info page, allowing R4 or higher officers to adjust lanes more efficiently.\n6. Teleport: While using a \"Territory Teleporter\", you can freely adjust and select your target location before confirmation. If your target location is within your Alliance territory, \"Territory Teleporters\" will be used first.\n7. Snowbusters:\na. Increased Fuel consumption and rewards for snow clearing (numerical adjustments only without changing the overall rewards). After a certain levels, monsters in an area can drop multiple Snowbuster Maps.\nb. Added a feature that allows you to exchange Fuel for Rockets after clearing Area 16.\nc. Added the Raid feature, which becomes available once you reach Area 24. You will be able to clear stages quickly by spending Fuel.\nd. Snowbusters Pass Optimization: Using Rockets now grants Snow Points. \n8. Chief Gear: When your state age reaches a certain number of days, we will introduce T4 Legendary Gear (3-Star) and expand the sources for Chief Gear enhancement materials. The details are as follows:\na. Labyrinth Shop: \"Chief Gear Materials Chest\" will become available.\nb. Alliance Championship Shop: The weekly purchase limit for \"Polishing Solution\", \"Design Plan\", and \"Hardened Alloy\" will be increased.\nc. Crazy Joe: Personal Ranking Rewards and Alliance Ranking Rewards will be updated.\n9. Frostdragon Tyrant: Introduced State Rewards for all Chiefs at Furnace Lv. 20 or higher in the states of the top 10 Chiefs on the Occupation Ranking. Additionally, the Tyrant’s Gift will now appear at a random location near the Sunfire Castle instead of a fixed position.\n10. Tundra Arms League: Introduced rank-determined State Rewards for all Chiefs at Furnace Lv. 20 or higher in the states of the top 4 Legions, which can be claimed manually.\n11. Foundry Battle: After occupying a building for 30 minutes in Foundry Battle and Tundra Arms League, you will gain Personal Points much faster.\n12. Mercenary Prestige: When your state unlocks Fire Crystal Lv. 8, a new type of Legend's Initiation will be introduced, and the current one will be renamed as Epic Initiation.\n13. The Labyrinth: Introduced the Alliance Member Leaderboard, allowing you to view your allies' performances.",
          "app_id": "6443575749"
        },
        "Disney Solitaire": {
          "version": "1.7.1",
          "updated": "2025-10-23T09:42:27Z",
          "releaseNotes": "Get ready for an amazing update!\n* Prepare for NEW levels!\n* Unlock NEW Disney characters!\n* Join the magic with NEW DISNEY FEATURES!\n* Enjoy performance improvements for a smoother gaming experience!\nPlay Disney Solitaire!",
          "app_id": "6475757306"
        },
        "Drop the Cat": {
          "version": "1.10.8",
          "updated": "2025-10-28T06:13:12Z",
          "releaseNotes": "New Stage Added!\n\nHalloween is Coming!\n\nRaise your own Cats!",
          "app_id": "6749132002"
        },
        "Last War:Survival": {
          "version": "1.0.316",
          "updated": "2025-10-23T09:29:11Z",
          "releaseNotes": "1. Optimized the text display for offline time in the Alliance member list.\n2. Optimized the maximum zoom ratio for maps in teleport mode and adapted the top layout display effects for some devices during zooming.",
          "app_id": "6448786147"
        },
        "Wool Crush -Escape Traffic Jam": {
          "version": "2.4",
          "updated": "2025-10-23T07:28:28Z",
          "releaseNotes": "Smashed some bugs and perfected your experience",
          "app_id": "6743385713"
        },
        "Last Z: Survival Shooter": {
          "version": "1.250.682",
          "updated": "2025-10-23T07:21:09Z",
          "releaseNotes": "bugs fixed.",
          "app_id": "6503272652"
        },
        "Kingshot": {
          "version": "1.7.12",
          "updated": "2025-10-28T07:10:55Z",
          "releaseNotes": "[New Content]\n1. New Feature: Mystic Trial. A brand-new adventure awaits! \n2. New Feature: Leading Glory. During Kingdom Transfer, your Kingdom will receive a Leading Emblem each time it qualifies as a Leading Kingdom. Accumulate Leading Emblems to unlock special Leading Glory skins. Show off your Kingdom's dominance!\n3. New Feature: Mood Status. Set a status to let others know how you're feeling, making social interactions more fun and personal.",
          "app_id": "6739554056"
        },
        "Hexa Sort": {
          "version": "4.8.00",
          "updated": "2025-10-28T07:42:30Z",
          "releaseNotes": "Events of October:\n- Get ready to collect them all - Maple Collection is here! Will you become the ultimate card collector?\n- The wicked pumpkins are watching. Collect them all if you dare! Jack O’ Lantern Season has just begun!\n- Join the Pumpkin Smash Party! Take a swing and watch pumpkins burst into a shower of treats!\n- The Wicked Mansion is about to be discovered, where every hall whispers secrets!",
          "app_id": "6463127238"
        },
        "Subway Surfers": {
          "version": "3.53.5",
          "updated": "2025-10-23T13:02:55Z",
          "releaseNotes": "- Come join the Crew in Mexico and celebrate Halloween and Dia De Los Muertos. Run through the spooky streets of Mexico, full of festive decorations.\n- Unlock new and exciting content, including our new Characters Alma Brava, the spirited cheerleader & Mateo, the rebellious soccer star.\n- Join special challenges, earn haunting rewards and unlock new Outfits!",
          "app_id": "512939461"
        },
        "Differences - Find & Spot It": {
          "version": "2.4.2",
          "updated": "2025-09-18T15:42:24Z",
          "releaseNotes": "Hey all players,\nThis update includes bug fixes and performance improvements.\nExplore the fun of spotting differences in tons of beautifully designed pictures!\nIf you have any questions or suggestions, feel free to contact us at af@gurugame.ai.\nThanks for choosing us!",
          "app_id": "6504279468"
        },
        "Solitaire Classic - 2026": {
          "version": "1.946",
          "updated": "2025-08-29T08:03:56Z",
          "releaseNotes": "",
          "app_id": "6751533084"
        },
        "Gossip Harbor®: Merge & Story": {
          "version": "3.76.0",
          "updated": "2025-10-22T11:03:36Z",
          "releaseNotes": "NEW EPISODE EVERY FRIDAY!\n- NEW EPISODE: With new chapter updates every Friday; follow Quinn as she exposes secrets and solves puzzles.\n- NEW EVENT:Visit the Dark Zone and unlock the Howling Factory! Join Sam, Colton and Harrison as they're transported to a strange nightmare world. Help them escape by collecting points and unlock exclusive decorations to complete the event.",
          "app_id": "1623318294"
        },
        "Wool Craze -Yarn Color Sort 3D": {
          "version": "4.1",
          "updated": "2025-10-24T06:03:33Z",
          "releaseNotes": "Added interesting new levels to enrich your adventure:)",
          "app_id": "6744317674"
        },
        "Royal Match": {
          "version": "32131",
          "updated": "2025-10-27T08:01:19Z",
          "releaseNotes": "Are you ready for a spooky new update?\n\n• Get ready for amazing 100 NEW LEVELS! Hit the CLOCK TOWER and watch the GEARS burst onto the board!\n\n• Explore the NEW AREA! Stock up on scares and sweets in the HALLOWEEN SHOP!\n\nNew levels are coming in every two weeks! Be sure to update your game to get the latest content!",
          "app_id": "1482155847"
        },
        "Magic Tiles 3: Piano Game": {
          "version": "12.101.007",
          "updated": "2025-10-18T03:17:26Z",
          "releaseNotes": "We regularly update the game to enhance your experience! Don’t forget to update and enjoy the latest improvements. Stay connected with us on TikTok, YouTube, Facebook, and Instagram @magictiles3.",
          "app_id": "1443446174"
        },
        "Goods Puzzle: Sort Challenge": {
          "version": "4.30",
          "updated": "2025-10-26T01:04:14Z",
          "releaseNotes": "- Fix some bugs",
          "app_id": "6482849843"
        },
        "Homescapes": {
          "version": "8.3.6",
          "updated": "2025-10-23T09:04:00Z",
          "releaseNotes": "Get ready for a thrilling Homescapes update!\n \nHALLOWEEN: A NIGHT IN THE WOODS\n• Help Robbie find his daughter Chloe in the nighttime forest!\n• Uncover the mystery of the sinister masked figure!\n• Finish the event to earn a unique decoration!\n \nTHE FRONTIER'S GOLD\n• Learn the story of Austin's great-grandmother, the fearless Marshal Goldy!\n• Foil the local bandits' plans and be the first to claim the legendary treasures!\n• Finish the event to earn a unique decoration!\n \nALSO\n• Spooky Pass and Home Pass! Activate the passes to get coins, boosters, and other valuable rewards!\n• The Other Half story continues! Who will Katherine choose?",
          "app_id": "1195621598"
        },
        "Imposter - Party Word Game": {
          "version": "3.5.0",
          "updated": "2025-09-03T07:02:29Z",
          "releaseNotes": "New: Optional hint word for the Imposter. Helps them get away - can you still spot them?",
          "app_id": "6745120053"
        },
        "Among Us!": {
          "version": "2025.10.14",
          "updated": "2025-10-15T18:46:16Z",
          "releaseNotes": "Bug fixes",
          "app_id": "1351168404"
        },
        "Call of Duty®: Mobile": {
          "version": "1.0.52",
          "updated": "2025-07-28T03:12:00Z",
          "releaseNotes": "Descend into uncharted depths with Call of Duty®: Mobile’s Season 7: Phantom Current! Unearth the secrets of the abyss and encounter CODM’s sixth Mythic Operator, Dark Shepherd, a special crossover with Girls’ Frontline, and a refreshed Legendary reward in the Secret Cache system. \n\nNew Mythic Dark Shepherd: \nUnleash darkness with the most sinister Mythic Operator yet, Dark Shepherd – Phantom. Wield the Epic Scythe and Legendary AS-VAL to dominate the lobby with forces from another dimension. With power coursing through your veins, every fight becomes a surge of unstoppable force. \n\nNew Secret Cache Reward: \nAnother Legendary weapon skin is landing in the Secret Cache system! Log in and play to start earning the RUS-79U – Mystical Lamp… before it vanishes in a puff of smoke—and no genie can bring it back. \n \nGirls’ Frontline: \nGirls’ Frontline deploys into Call of Duty®: Mobile in Season 7! Recruit an iconic T-Doll Operator and gear up with exclusive themed items. Complete the seasonal event to de-stress, reload, and reinforce your squad with free Girls’ Frontline rewards. \n\nNew Battle Passes:  \nSeason 7 brings an all-new Battle Pass and the opportunity to earn 50 tiers of free and premium rewards, including the new MG 82 weapon and Bomb Drone Scorestreak! Gear up and stay the course—more treasures await you in the Season 8 Battle Pass! \n\nNew Battle Pass Vaults:    \nFan-favorite Battle Passes are setting sail once again in the Vault for Seasons 7 and 8—don’t miss your chance to rearm with gear from past deployments! Season 7 brings Season 11: Ultimate Frontier (2022) and Season 7: Heat Wave (2023) back on deck. Hold steady—more cargo is charted for arrival in Season 8! \n\nMajor Gameplay Updates: \nSeason 7 shifts into high gear with all-new gameplay updates for a fresh dose of chaos! Get ready to burn rubber in Mini Mayhem, where you’ll zip around the map battling for first place in an RCXD. And for the first time ever, CODM Battle Royale gets its own Gulag—fight your way back from elimination in a gritty 1v1 showdown on ‘Isolated’. \n\nFrom deep-sea secrets to Mythic mayhem, Call of Duty®: Mobile Season 7: Phantom Current plunges you into a fresh experience. The current’s pulling you in—so gear up and dive headfirst into the action!",
          "app_id": "1287282214"
        },
        "Color Block Jam": {
          "version": "1.28.15",
          "updated": "2025-10-24T06:33:08Z",
          "releaseNotes": "New look, same fun! We’ve refreshed our shimmering new game icon, perfectly matching the sparkle and excitement of our new event — BLOCK HEIST! It brings shimmering Gold, Emerald, and Diamond blocks. Pass them through matching gates before time runs out and earn incredible rewards. Plan your moves, time your actions, and complete the heist before the blocks slip away. Are you up for the challenge? Don’t miss the new update!",
          "app_id": "6504332779"
        },
        "Block Crush！": {
          "version": "3.2.4",
          "updated": "2025-10-22T11:55:02Z",
          "releaseNotes": "This update brings performance improvements and a smoother gameplay experience.",
          "app_id": "1638139403"
        },
        "NYT Games: Wordle & Crossword": {
          "version": "6.0.0",
          "updated": "2025-10-27T17:49:20Z",
          "releaseNotes": "This version contains improvements to keep you solving smoothly!                                                                               \n\nHave feedback? Email us. nytgames@nytimes.com",
          "app_id": "307569751"
        },
        "Pixel Flow!": {
          "version": "0.6.0",
          "updated": "2025-10-26T14:56:52Z",
          "releaseNotes": "New levels are here! We’re thrilled to bring you a new version packed with improvements! This update adds exciting new content, refined visuals, and smoother controls. Alongside these upgrades, we’ve resolved several pesky issues to make your gameplay feel better than ever. Update now and enjoy the enhanced experience!",
          "app_id": "6751056652"
        },
        "Triumph: Play for Cash": {
          "version": "2.77.1",
          "updated": "2025-10-14T18:00:19Z",
          "releaseNotes": "Pro tip: You don't get paid if you die",
          "app_id": "1608987929"
        },
        "Eatventure": {
          "version": "1.45.1",
          "updated": "2025-10-24T06:51:01Z",
          "releaseNotes": "- Fixed a bug preventing usernames starting with the letter \"i\"  \n- Tech update  \n\nThanks for playing!",
          "app_id": "1600871388"
        },
        "Fruit Merge: Match Game": {
          "version": "7.3",
          "updated": "2025-10-08T02:26:55Z",
          "releaseNotes": "Some bugs fixed",
          "app_id": "6471572249"
        },
        "Tile Explorer: Tiles Clear!": {
          "version": "1.59.0",
          "updated": "2025-10-23T14:58:23Z",
          "releaseNotes": "◆ Feature updates\n◆ Bug fixes and other optimizations",
          "app_id": "6498883328"
        },
        "ColorBlock : Combo Blast": {
          "version": "5.6",
          "updated": "2025-10-29T08:42:44Z",
          "releaseNotes": "Explore Color Block version 5.6!\n\n- Performance and stability improvements\n- Minor bug fixes",
          "app_id": "6478063606"
        },
        "Clash of Clans": {
          "version": "17.477.13",
          "updated": "2025-10-23T10:22:37Z",
          "releaseNotes": "Rank Up!\n·   Multiplayer split! Join Tournaments and climb new Leagues in Ranked Battles, or duke it out in regular Battles without the risk of losing Trophies.\n·   Revenge is back, and it’s sweet! Attack players that raided your Village to get your resources back!\n·   Shields have switched up! Introducing Magic Shields that protect resources and Legend Shields that skip upcoming League Days.\n·   Other Changes: We’re reworking Spring Traps and removing Town Hall Weapon Levels.",
          "app_id": "529479190"
        },
        "Bubble Cash": {
          "version": "11.6.2",
          "updated": "2025-10-24T08:27:30Z",
          "releaseNotes": "Thanks for Playing Bubble Cash!\n\nIn this version we’ve -\n- Improved gameplay and overall experience through bug fixes.\n\nInvite your friends to play Bubble Cash & get $1 Bonus Cash for each friend that joins! We also recommend joining our community on Facebook for more exciting activities and Freebies.\n\nBe sure your game is up to date so you can truly experience all there is to offer.\n\nEnjoying Bubble Cash? Leave a review :)",
          "app_id": "1475514684"
        },
        "Disney Magic Match 3D": {
          "version": "5.1.0",
          "updated": "2025-10-22T23:55:25Z",
          "releaseNotes": "Bug Fixes & Improvements",
          "app_id": "6468690398"
        },
        "8 Ball Pool™": {
          "version": "56.13.0",
          "updated": "2025-10-03T16:06:35Z",
          "releaseNotes": "- You can now search, filter, and sort your Cues!\n- Fine-tune ruler has been improved with precise accuracy\n\nBe on the lookout for the next exciting new events:\nSeptember 17 - UFC Special Collaboration with a brand new Season\nOctober 8 - Flashback Moonlight Season\nOctober 15 - Monster Madness Season\nNovember 5 - Brainrot Season\n\nUpdate 8 Ball Pool to try it now!",
          "app_id": "543186831"
        },
        "Solitaire Smash: Real Cash!": {
          "version": "4.3",
          "updated": "2025-10-22T07:51:30Z",
          "releaseNotes": "Thanks for playing Solitaire Smash!\nOur latest version comes packed with new tournaments, new challenges, performance enhancements and bug fixes.\nInvite your friends to get $10 Bonus Cash for each friend that joins!\nFollow our Facebook & Instagram pages for more fun activities & freebies.\nYour feedback is vital to us; it's what allows Solitaire Smash continue to improve. If you love the game, please consider leaving a review on the app store.\nHappy gaming!",
          "app_id": "6446482475"
        },
        "Solitaire Cash": {
          "version": "11.6.0",
          "updated": "2025-10-21T07:49:15Z",
          "releaseNotes": "Thanks for Playing Solitaire Cash!\n\nIn this version we’ve -\n- Improved gameplay and overall experience through bug fixes.\n\nInvite your friends to play Solitaire Cash & get $1 Bonus Cash for each friend that joins! We also recommend joining our community on Facebook for more exciting activities and Freebies.\n\nBe sure your game is up to date so you can truly experience all there is to offer.\n\nEnjoying Solitaire Cash? Leave a review",
          "app_id": "1446254576"
        }
      }
    }
  },
  "TW": {
    "ios": {
      "top_grossing": {
        "寒霜啟示錄": {
          "version": "1.28.18",
          "updated": "2025-10-22T07:06:00Z",
          "releaseNotes": "[New Content]\n1. New Feature: Tundra Album. Forge your legend in the icy realm! Gather Scene Fragments scattered across the tundra. And piece them together into spectacular scenes. Relive the timeless legends of the frost-bound era and make history yourself!\n2. New Feature: Leading Glory system. Each time your state qualifies as a Leading State during State Transfer, it will receive a Leading Emblem. The Leading Emblems can be used to unlock exclusive rewards such as Sunfire Castle Shield Skin, State Transfer Event State Name Card, Sunfire Castle Skin and Turret Skin, and Exclusive State Title. Stay proud of your state!\n3. New Event: Dead Shot When participating in regular events, you have a chance of earning \"Shotchits\". You can use the \"Shotchits\" to play a shooting game. Hit the bullseye for bountiful rewards! Every 2 \"Chest Keys\" collected can be used to open a chest that contains extra bonuses. By spending enough Shotchits, you can unlock the exclusive Action Emote: Hit!\n\n[Optimization & Adjustment]\n1. Bear Hunt: Added the Auto-Register feature, which automatically starts a Bear Hunt based on the last opening time once the cooldown ends.\n2. Castle Battle: Reduced the battle duration to 5 hours and the required occupation time for victory to 2.5 hours, without changing the battlefield opening hours.\n3. Daybreak Island: Added a new basic decoration, \"Marble Fence\". Introduced the Like History feature, allowing you to view likes from other Chiefs.\n4. Lighthouse Intel: Upon reaching Furnace Lv. 15 or VIP Lv. 5, you will unlock the \"Claim All\" feature for claiming your Intel rewards.\n5. Alliance Championship: Added the \"Batch-Adjust\" feature to the troop info page, allowing R4 or higher officers to adjust lanes more efficiently.\n6. Teleport: While using a \"Territory Teleporter\", you can freely adjust and select your target location before confirmation. If your target location is within your Alliance territory, \"Territory Teleporters\" will be used first.\n7. Snowbusters:\na. Increased Fuel consumption and rewards for snow clearing (numerical adjustments only without changing the overall rewards). After a certain levels, monsters in an area can drop multiple Snowbuster Maps.\nb. Added a feature that allows you to exchange Fuel for Rockets after clearing Area 16.\nc. Added the Raid feature, which becomes available once you reach Area 24. You will be able to clear stages quickly by spending Fuel.\nd. Snowbusters Pass Optimization: Using Rockets now grants Snow Points. \n8. Chief Gear: When your state age reaches a certain number of days, we will introduce T4 Legendary Gear (3-Star) and expand the sources for Chief Gear enhancement materials. The details are as follows:\na. Labyrinth Shop: \"Chief Gear Materials Chest\" will become available.\nb. Alliance Championship Shop: The weekly purchase limit for \"Polishing Solution\", \"Design Plan\", and \"Hardened Alloy\" will be increased.\nc. Crazy Joe: Personal Ranking Rewards and Alliance Ranking Rewards will be updated.\n9. Frostdragon Tyrant: Introduced State Rewards for all Chiefs at Furnace Lv. 20 or higher in the states of the top 10 Chiefs on the Occupation Ranking. Additionally, the Tyrant’s Gift will now appear at a random location near the Sunfire Castle instead of a fixed position.\n10. Tundra Arms League: Introduced rank-determined State Rewards for all Chiefs at Furnace Lv. 20 or higher in the states of the top 4 Legions, which can be claimed manually.\n11. Foundry Battle: After occupying a building for 30 minutes in Foundry Battle and Tundra Arms League, you will gain Personal Points much faster.\n12. Mercenary Prestige: When your state unlocks Fire Crystal Lv. 8, a new type of Legend's Initiation will be introduced, and the current one will be renamed as Epic Initiation.\n13. The Labyrinth: Introduced the Alliance Member Leaderboard, allowing you to view your allies' performances.",
          "app_id": "6443575749"
        },
        "星城Online-普發一萬現領現玩": {
          "version": "6.44",
          "updated": "2025-10-23T00:46:57Z",
          "releaseNotes": "【火爆辣椒】HOT！越辣越補倍數狂飆\n【星城刮好運】新增【女王克麗奧】【魔法萬聖夜】刮刮卡\n大廳音樂新增【蝠影狂歡】\n啦啦隊李多慧跟中秋節慶卡刮刮卡離開星城",
          "app_id": "919043762"
        },
        "最後的戰爭 - Last War": {
          "version": "1.0.316",
          "updated": "2025-10-23T09:29:11Z",
          "releaseNotes": "1. Optimized the text display for offline time in the Alliance member list.\n2. Optimized the maximum zoom ratio for maps in teleport mode and adapted the top layout display effects for some devices during zooming.",
          "app_id": "6448786147"
        },
        "Kingshot": {
          "version": "1.7.12",
          "updated": "2025-10-28T07:10:55Z",
          "releaseNotes": "[New Content]\n1. New Feature: Mystic Trial. A brand-new adventure awaits! \n2. New Feature: Leading Glory. During Kingdom Transfer, your Kingdom will receive a Leading Emblem each time it qualifies as a Leading Kingdom. Accumulate Leading Emblems to unlock special Leading Glory skins. Show off your Kingdom's dominance!\n3. New Feature: Mood Status. Set a status to let others know how you're feeling, making social interactions more fun and personal.",
          "app_id": "6739554056"
        },
        "麻將明星3缺1": {
          "version": "6.9.158",
          "updated": "2025-10-07T01:27:04Z",
          "releaseNotes": "【联名合作】贴图NO.1的白烂猫也来明星3缺1啦\n【全新角色】无论麻将牌桌、炮塔对决通通有白烂猫主题角色可以使用\n【更多游戏】更多风格的休闲小游戏，在明星3缺1都玩得到\n【问题修正】修正并且优化了一些游戏体验",
          "app_id": "501306812"
        },
        "Last Z:Survival Shooter（倖存者逃亡）": {
          "version": "1.250.682",
          "updated": "2025-10-23T07:21:09Z",
          "releaseNotes": "bugs fixed.",
          "app_id": "6503272652"
        },
        "糖果傳奇": {
          "version": "1.314.1.1",
          "updated": "2025-10-27T07:10:20Z",
          "releaseNotes": "We hope you’re having fun playing Candy Crush Saga! \n\nWe update the game every week with sweet new features, exciting levels, and important bug fixes to keep everything running smoothly. \n\nDon't forget to download the latest version for the best experience!\n\nNew to the game? Don’t be shy, join the fun!",
          "app_id": "553834731"
        },
        "Dark War:Survival": {
          "version": "1.250.619",
          "updated": "2025-10-24T09:55:34Z",
          "releaseNotes": "[Adjustments & Optimizations]\n\n[State of Supremacy]\n- Points adjustment during the Invasion Right contest phase\nBefore: Successfully seize the enemy State Dark Syndicate Truck once\nAfter: Escort an S-Tier Dark Syndicate Truck once (points awarded based on whether it is plundered).\n\n[Capital Clash]\nAdjustments for point acquisition ways: \n- Garrison the Capital\n- Garrison Turrets\n- Kill enemy units at the Capital\n- Suffer severe injuries or unit losses at the Capital\n- Kill units during turret battles\n- Suffer severe injuries or unit losses during turret battles\n\n[Territory Triumph]\n- Added the [Schedule War] feature. Alliance members can view scheduled information in the event interface.\n- Once the scheduled time is reached, the war will automatically start.\n- Cities with scheduled war plans can still be attacked immediately.\n\n[Zombie Siege]\n- When the event time conflicts with [Blood Moon Shroud], a secondary confirmation prompt will appear.\n- Each season will feature zombies with different themed appearances.\n\n[Other Improvements]\n- Chat channels now support recalling text and images sent within 2 minutes.\n- [Allied Power] now allows viewing of daily refreshable exclusive tasks.\n- After zooming the world map, survivors can still view the [Peace Shield] status of shelters.",
          "app_id": "6670441558"
        },
        "Pokémon GO": {
          "version": "0.385.0",
          "updated": "2025-10-27T17:23:13Z",
          "releaseNotes": "Trainers, we hope you’re enjoying your adventure in Pokémon GO! We update the app regularly with new events and features, so make sure to check the in-game News to stay up to date.",
          "app_id": "1094591345"
        },
        "MLB：9局職棒25": {
          "version": "10.1.0",
          "updated": "2025-09-25T02:00:50Z",
          "releaseNotes": "- New Supreme Players have been added.\n- Upgrade Storage has been added.\n- The 2025 Postseason Event Shop has been added.\n- A 9th Anniversary Special Gift has been added.\n- Custom Game mode has been added.\n\nGot feedback? Leave a review or contact our Customer Support by visiting http://customer-m.withhive.com/ask",
          "app_id": "1059665257"
        },
        "緋聞港口：合併&故事": {
          "version": "3.76.0",
          "updated": "2025-10-22T11:03:36Z",
          "releaseNotes": "NEW EPISODE EVERY FRIDAY!\n- NEW EPISODE: With new chapter updates every Friday; follow Quinn as she exposes secrets and solves puzzles.\n- NEW EVENT:Visit the Dark Zone and unlock the Howling Factory! Join Sam, Colton and Harrison as they're transported to a strange nightmare world. Help them escape by collecting points and unlock exclusive decorations to complete the event.",
          "app_id": "1623318294"
        },
        "麻將 神來也麻將－台灣16張、麻雀": {
          "version": "18.9.1",
          "updated": "2025-10-13T02:21:30Z",
          "releaseNotes": "Improved gameplay.\n\nNote:\nIf you have trouble logging in or forgot your password, please click on \"Can't sign in\" on the login screen to send a report. We will immediately take care of the issue.\n\nGamesofa are constantly striving to improve the quality of our games. If you have any suggestions, please let us know using the customer feedback function so we can solve the problem. Thank you!",
          "app_id": "455902495"
        },
        "Coin Master": {
          "version": "3.5.2290",
          "updated": "2025-10-27T07:55:07Z",
          "releaseNotes": "Thanks for playing Coin Master!\n\nIn this version, we’ve implemented bug fixes & performance improvements.\n\nWe have also implemented our new reward calendar feature - collect your daily rewards! \n\nEnjoy a world of fun, thrills, and huge rewards right at your fingertips. \n\nInvite your friends to play Coin Master & get your FREE REWARDS! We also recommend joining our community on Facebook, Twitter, and Instagram for more fun & excitement.\n\nEnjoying Coin Master? Leave a review :)",
          "app_id": "406889139"
        },
        "七騎士 Re:BIRTH": {
          "version": "1.07.04",
          "updated": "2025-10-03T01:51:28Z",
          "releaseNotes": "[New Additions]\n- New Legendary Hero [Kagura] added.\n- New Legendary Hero [Amelia] added.\n- New content [Advent Expedition] added.\n- New Adventure area [Earth Gate] added.\n- 7 new costumes added.\n- Accessory Crafting added.\n-Equipment Presets added.\n\n[Improvements and Fixes]\n- Improved Content Convenience\n- Bug Fixes and Other Improvements",
          "app_id": "6479595079"
        },
        "滿貫大亨 - 快打旋風登場": {
          "version": "1.1.234",
          "updated": "2025-10-29T01:01:18Z",
          "releaseNotes": "《仙境傳說》傳說再起，乘倍一路狂飆！",
          "app_id": "1007924271"
        },
        "王國之歌（Top Heroes）": {
          "version": "1.78.12",
          "updated": "2025-10-27T08:02:37Z",
          "releaseNotes": "Season 3 “Eternal Night Pact” ignites with passion! Choose your faction of faith, complete missions to earn reputation, unlock powerful bonuses and unique trials! Join the pact, ignite your battle spirit, and forge your legend!",
          "app_id": "6450953550"
        },
        "SD鋼彈 G世代 永恆": {
          "version": "1.7.2",
          "updated": "2025-10-20T08:10:55Z",
          "releaseNotes": "- Minor Improvements and Bug Fixes",
          "app_id": "6692615881"
        },
        "Pokémon TCG Pocket": {
          "version": "1.4.0",
          "updated": "2025-10-29T01:00:40Z",
          "releaseNotes": "● Mega Rising: Mega Gyarados, Mega Rising: Mega Blaziken, and and Mega Rising: Mega Altaria booster packs are now available.\n● New share feature.\n● More cards eligible for trading.\n● Wonder pick feature updated.\n● Flair can now be obtained automatically.\n● Increased the number of decks you can build.\n● Player level max has been increased.\n● Improvements to some features.",
          "app_id": "6479970832"
        },
        "小兵特攻隊": {
          "version": "3.3.2",
          "updated": "2025-10-20T03:07:52Z",
          "releaseNotes": "Bug fixes and performance improvements",
          "app_id": "6746140478"
        },
        "夢幻花園 (Gardenscapes)": {
          "version": "9.1.0",
          "updated": "2025-10-03T13:08:16Z",
          "releaseNotes": "A fall Gardenscapes update!\nNEW EVENTS\nLegends of Transylvania: find the missing girls and complete a horror quest!\nScourge of the Seas: embark on a real pirate adventure for treasure!\n\nSTORYLINE\nFind out what Bill Young's parents were secretly working on at their oceanographic station!",
          "app_id": "1105855019"
        },
        "弓箭傳說2": {
          "version": "1.1.3",
          "updated": "2025-10-22T12:30:13Z",
          "releaseNotes": "1. Lost Kingdom series heroes: Cleo, Phynx, Mymu, and their new Halloween skins \"Fiery Reckoning,\" \"Scarlet Sandstorm,\" and \"Empowered Curse.\"\n2. Halloween Special Event: Candy Carnival! Get the new Halloween-themed relics: Frostflame Lamp and Boltfang Candy Jar!\n3. Halloween Limited Brawl Mode: Trick-or-Treat Party!\n4. Guild Expedition will now be season-based, and the first season is about to officially begin!\n5. Optimized Arena Grouping for new servers.",
          "app_id": "6502820653"
        },
        "大福Online-老虎機、捕魚、推幣機、刮刮樂、拉霸 娛樂城": {
          "version": "14.5",
          "updated": "2025-10-21T09:14:55Z",
          "releaseNotes": "Hey! NEW SLOT GAMES served!\nInstall to enjoy better experience and holiday events now!\n\n– NEW SLOT GAMES!\nThunder Fire Sparkle，Crazy Mine Bomber, The Halloween Bats ...\n\n– IMPROVED EXPERIENCE!\nSeveral bugs have been fixed to provide better user experience!",
          "app_id": "1356980152"
        },
        "Royal Match": {
          "version": "32131",
          "updated": "2025-10-27T08:01:19Z",
          "releaseNotes": "Are you ready for a spooky new update?\n\n• Get ready for amazing 100 NEW LEVELS! Hit the CLOCK TOWER and watch the GEARS burst onto the board!\n\n• Explore the NEW AREA! Stock up on scares and sweets in the HALLOWEEN SHOP!\n\nNew levels are coming in every two weeks! Be sure to update your game to get the latest content!",
          "app_id": "1482155847"
        },
        "夢幻家園 (Homescapes)": {
          "version": "8.3.6",
          "updated": "2025-10-23T09:04:00Z",
          "releaseNotes": "Get ready for a thrilling Homescapes update!\n \nHALLOWEEN: A NIGHT IN THE WOODS\n• Help Robbie find his daughter Chloe in the nighttime forest!\n• Uncover the mystery of the sinister masked figure!\n• Finish the event to earn a unique decoration!\n \nTHE FRONTIER'S GOLD\n• Learn the story of Austin's great-grandmother, the fearless Marshal Goldy!\n• Foil the local bandits' plans and be the first to claim the legendary treasures!\n• Finish the event to earn a unique decoration!\n \nALSO\n• Spooky Pass and Home Pass! Activate the passes to get coins, boosters, and other valuable rewards!\n• The Other Half story continues! Who will Katherine choose?",
          "app_id": "1195621598"
        },
        "《荒野亂鬥》": {
          "version": "64.226",
          "updated": "2025-10-28T08:56:33Z",
          "releaseNotes": "UPDATE 64: STRANGER THINGS\nNovember 2025 - December 2025\n∙ Head into the Upside Showdown, a new rogue-lite PVP mode! Get unique powers every game, making each run different!\n∙ Stranger Things skins, like Eleven Lumi & Scoops Ahoy Berry!\n∙ New Brawler: Gigi (Mythic Assassin)\n∙ Brawlidays get MECHA!\n∙ Brawl Pass Season 44: Stranger Things (November)\n∙ Brawl Pass Season 45: Mechmas (December)",
          "app_id": "1229016807"
        },
        "Sky光·遇": {
          "version": "0.31.1",
          "updated": "2025-10-28T18:51:28Z",
          "releaseNotes": "Take to the skies with Season of Migration! Guide a herd of migrating light creatures above clouds, through forests, and beyond mountains in weekly quests.\n\nMeanwhile—It's Mischief time! Head to the Cackling Crab to solve puzzles and surprise friends.",
          "app_id": "1462117269"
        },
        "怪獸 8號 THE GAME": {
          "version": "1.2.2",
          "updated": "2025-10-09T01:45:53Z",
          "releaseNotes": "Squashed some bugs.",
          "app_id": "6742088839"
        },
        "嘟嘟臉惡作劇": {
          "version": "1.0.3",
          "updated": "2025-10-08T07:00:00Z",
          "releaseNotes": "Pre-download begins on October 8th（UTC+9）, official service starts on October 9th（UTC+9）!\nLaunch celebration rewards are here! Log in now to claim them!",
          "app_id": "6479391944"
        },
        "點點大作戰": {
          "version": "2.3.800",
          "updated": "2025-10-16T07:19:06Z",
          "releaseNotes": "[New Content]\n- [Underground Goldmine] event grandly debuts! Deep underground lie rare gold resources, but also hidden are infected monster guards and other Chiefs pursuing the treasure. Will you dig deeper into the veins, protect the resources you’ve already gathered, or plunder others? This thrilling contest for gold resources awaits your command!\n\n- Eligible States will open the [Alliance Duel – Cross-State League] based on the Alliance Duel event! The brand-new league mode expands the matching range, introduces tiered grouping and promotion/relegation matching mechanisms, and offers richer rewards based on final tier. Heroes from all sides gather—come claim your Alliance glory!\n\n[Optimizations & Fixes]\n- Optimized the [Friend Gift] feature. After the update, a gift administrator will be added outside the shelter, allowing Chiefs to check gift history at any time so that every token of friendship is preserved.\n\n- Optimized animations and interface performance for survivor events.\n\n- Optimized the [Reservoir Raid] event:\n1. Added [Total Wins] display for each Alliance within the same group on the battle record page.\n2. Added [Total Wins] rewards on the achievement tab, so that whenever an Alliance reaches a certain number of victories in the Reservoir Raid event, all members of the Alliance will receive the corresponding achievement rewards!\n\n- Optimized hero Layla’s war skill [Rejuvenate]. On top of retaining the original skill effects, Layla now deals damage to enemies when casting this skill. The detailed description can be viewed on the hero skill screen.",
          "app_id": "6738109752"
        }
      },
      "top_free": {
        "卡厄思夢境": {
          "version": "1.0.203",
          "updated": "2025-10-21T07:00:00Z",
          "releaseNotes": "Bug fixes and improvements",
          "app_id": "6502326151"
        },
        "小兵特攻隊": {
          "version": "3.3.2",
          "updated": "2025-10-20T03:07:52Z",
          "releaseNotes": "Bug fixes and performance improvements",
          "app_id": "6746140478"
        },
        "Block Blast!": {
          "version": "6.4.5",
          "updated": "2025-10-27T02:11:11Z",
          "releaseNotes": "We’re always improving Block Blast! Turn on auto-updates to get the latest features.\n\nSuggestions? Email us: blockblast-support@hungrystudio.com\nFollow us on TikTok for updates: @blockblastofficial",
          "app_id": "1617391485"
        },
        "Foodie Sizzle: 美食滋滋": {
          "version": "1.41",
          "updated": "2025-10-25T07:23:21Z",
          "releaseNotes": "- Bug fixes\n- Adjusted level difficulty\n- Added new Halloween event",
          "app_id": "6746246179"
        },
        "Grill Sort - 燒烤時光 物品分類遊戲": {
          "version": "2.6",
          "updated": "2025-10-22T09:02:04Z",
          "releaseNotes": "We added many new levels, waiting for you to conquer!",
          "app_id": "6742812903"
        },
        "Last Z:Survival Shooter（倖存者逃亡）": {
          "version": "1.250.682",
          "updated": "2025-10-23T07:21:09Z",
          "releaseNotes": "bugs fixed.",
          "app_id": "6503272652"
        },
        "毛線衝擊 - Traffic Jam公車遊戲 塞車解謎": {
          "version": "2.4",
          "updated": "2025-10-23T07:28:28Z",
          "releaseNotes": "Smashed some bugs and perfected your experience",
          "app_id": "6743385713"
        },
        "嘟嘟臉惡作劇": {
          "version": "1.0.3",
          "updated": "2025-10-08T07:00:00Z",
          "releaseNotes": "Pre-download begins on October 8th（UTC+9）, official service starts on October 9th（UTC+9）!\nLaunch celebration rewards are here! Log in now to claim them!",
          "app_id": "6479391944"
        },
        "寒霜啟示錄": {
          "version": "1.28.18",
          "updated": "2025-10-22T07:06:00Z",
          "releaseNotes": "[New Content]\n1. New Feature: Tundra Album. Forge your legend in the icy realm! Gather Scene Fragments scattered across the tundra. And piece them together into spectacular scenes. Relive the timeless legends of the frost-bound era and make history yourself!\n2. New Feature: Leading Glory system. Each time your state qualifies as a Leading State during State Transfer, it will receive a Leading Emblem. The Leading Emblems can be used to unlock exclusive rewards such as Sunfire Castle Shield Skin, State Transfer Event State Name Card, Sunfire Castle Skin and Turret Skin, and Exclusive State Title. Stay proud of your state!\n3. New Event: Dead Shot When participating in regular events, you have a chance of earning \"Shotchits\". You can use the \"Shotchits\" to play a shooting game. Hit the bullseye for bountiful rewards! Every 2 \"Chest Keys\" collected can be used to open a chest that contains extra bonuses. By spending enough Shotchits, you can unlock the exclusive Action Emote: Hit!\n\n[Optimization & Adjustment]\n1. Bear Hunt: Added the Auto-Register feature, which automatically starts a Bear Hunt based on the last opening time once the cooldown ends.\n2. Castle Battle: Reduced the battle duration to 5 hours and the required occupation time for victory to 2.5 hours, without changing the battlefield opening hours.\n3. Daybreak Island: Added a new basic decoration, \"Marble Fence\". Introduced the Like History feature, allowing you to view likes from other Chiefs.\n4. Lighthouse Intel: Upon reaching Furnace Lv. 15 or VIP Lv. 5, you will unlock the \"Claim All\" feature for claiming your Intel rewards.\n5. Alliance Championship: Added the \"Batch-Adjust\" feature to the troop info page, allowing R4 or higher officers to adjust lanes more efficiently.\n6. Teleport: While using a \"Territory Teleporter\", you can freely adjust and select your target location before confirmation. If your target location is within your Alliance territory, \"Territory Teleporters\" will be used first.\n7. Snowbusters:\na. Increased Fuel consumption and rewards for snow clearing (numerical adjustments only without changing the overall rewards). After a certain levels, monsters in an area can drop multiple Snowbuster Maps.\nb. Added a feature that allows you to exchange Fuel for Rockets after clearing Area 16.\nc. Added the Raid feature, which becomes available once you reach Area 24. You will be able to clear stages quickly by spending Fuel.\nd. Snowbusters Pass Optimization: Using Rockets now grants Snow Points. \n8. Chief Gear: When your state age reaches a certain number of days, we will introduce T4 Legendary Gear (3-Star) and expand the sources for Chief Gear enhancement materials. The details are as follows:\na. Labyrinth Shop: \"Chief Gear Materials Chest\" will become available.\nb. Alliance Championship Shop: The weekly purchase limit for \"Polishing Solution\", \"Design Plan\", and \"Hardened Alloy\" will be increased.\nc. Crazy Joe: Personal Ranking Rewards and Alliance Ranking Rewards will be updated.\n9. Frostdragon Tyrant: Introduced State Rewards for all Chiefs at Furnace Lv. 20 or higher in the states of the top 10 Chiefs on the Occupation Ranking. Additionally, the Tyrant’s Gift will now appear at a random location near the Sunfire Castle instead of a fixed position.\n10. Tundra Arms League: Introduced rank-determined State Rewards for all Chiefs at Furnace Lv. 20 or higher in the states of the top 4 Legions, which can be claimed manually.\n11. Foundry Battle: After occupying a building for 30 minutes in Foundry Battle and Tundra Arms League, you will gain Personal Points much faster.\n12. Mercenary Prestige: When your state unlocks Fire Crystal Lv. 8, a new type of Legend's Initiation will be introduced, and the current one will be renamed as Epic Initiation.\n13. The Labyrinth: Introduced the Alliance Member Leaderboard, allowing you to view your allies' performances.",
          "app_id": "6443575749"
        },
        "八零找茬": {
          "version": "1.0.8",
          "updated": "2025-10-16T01:21:17Z",
          "releaseNotes": "Optimize gameplay experience and fix game issues",
          "app_id": "6748932117"
        },
        "Kingshot": {
          "version": "1.7.12",
          "updated": "2025-10-28T07:10:55Z",
          "releaseNotes": "[New Content]\n1. New Feature: Mystic Trial. A brand-new adventure awaits! \n2. New Feature: Leading Glory. During Kingdom Transfer, your Kingdom will receive a Leading Emblem each time it qualifies as a Leading Kingdom. Accumulate Leading Emblems to unlock special Leading Glory skins. Show off your Kingdom's dominance!\n3. New Feature: Mood Status. Set a status to let others know how you're feeling, making social interactions more fun and personal.",
          "app_id": "6739554056"
        },
        "細胞保衛戰 - 生存射擊大亂鬥": {
          "version": "1.9",
          "updated": "2025-10-29T02:30:18Z",
          "releaseNotes": "Stability improvements and bug fixes.",
          "app_id": "6746465127"
        },
        "Brain Puzzle: Tricky Quest": {
          "version": "1.2.7",
          "updated": "2025-10-22T08:37:38Z",
          "releaseNotes": "• Fix some bugs",
          "app_id": "6670789598"
        },
        "Vita 麻將": {
          "version": "2.63.2",
          "updated": "2025-10-28T15:56:07Z",
          "releaseNotes": "-Bug fixes and performance improvements.",
          "app_id": "6468921495"
        },
        "Drop the Cat": {
          "version": "1.10.8",
          "updated": "2025-10-28T06:13:12Z",
          "releaseNotes": "New Stage Added!\n\nHalloween is Coming!\n\nRaise your own Cats!",
          "app_id": "6749132002"
        },
        "不用網路的遊戲 - 無網路遊戲 - 離線 遊戲 - 無網遊戲": {
          "version": "3.4.8",
          "updated": "2025-10-16T07:47:35Z",
          "releaseNotes": "• Added support for playing vs 2/3 bots in Ludo\n• Bug fixes and improvements",
          "app_id": "6448104157"
        },
        "緋聞港口：合併&故事": {
          "version": "3.76.0",
          "updated": "2025-10-22T11:03:36Z",
          "releaseNotes": "NEW EPISODE EVERY FRIDAY!\n- NEW EPISODE: With new chapter updates every Friday; follow Quinn as she exposes secrets and solves puzzles.\n- NEW EVENT:Visit the Dark Zone and unlock the Howling Factory! Join Sam, Colton and Harrison as they're transported to a strange nightmare world. Help them escape by collecting points and unlock exclusive decorations to complete the event.",
          "app_id": "1623318294"
        },
        "Top Tycoon: Coin Theme Empire": {
          "version": "1.0.7",
          "updated": "2025-09-03T01:59:35Z",
          "releaseNotes": "1. We’ve fixed bugs for a smoother gaming experience!\n2. And added new exciting content.\n\nKeep your game updated to enjoy all the great features!\n\nIf you’re enjoying \"Top Tycoon,\" we’d love to hear your thoughts! :)",
          "app_id": "6739124364"
        },
        "Roblox": {
          "version": "2.696.799",
          "updated": "2025-10-27T16:21:46Z",
          "releaseNotes": "To make Roblox work better for you, we deliver updates regularly. These updates include bug fixes and improvements for speed and reliability.",
          "app_id": "431946152"
        },
        "Royal Kingdom": {
          "version": "22800",
          "updated": "2025-10-20T07:59:51Z",
          "releaseNotes": "Play Royal Kingdom now!Get ready for a gorgeous new update!\n\n• Prepare yourself for 100 NEW LEVELS! Experience fun and exciting challenges!\n\n• Unlock the latest item, MOSAIC TILES! When the tiles start to crack, what’s beneath comes right back!\n\n• Defeat the new enemy, CACTUS! Looks like it’s gone for a while, then it pops up on another tile!\n\n• Partner up for the new event, HIDDEN PATH! Prove that teamwork’s might can quell the Dark Witch’s spell!\n\n• Explore the new district, MONORAIL! Keep expanding the kingdom to discover new horizons!\n\nPlay Royal Kingdom now!",
          "app_id": "1606549505"
        },
        "食光旅行": {
          "version": "41.0",
          "updated": "2025-10-27T02:52:53Z",
          "releaseNotes": "- Minor bug fixes and improvements",
          "app_id": "6471045672"
        },
        "可獄不可囚": {
          "version": "1.0.23",
          "updated": "2025-10-29T06:06:19Z",
          "releaseNotes": "Update game content.",
          "app_id": "6738469826"
        },
        "Pikmin Bloom": {
          "version": "131.1",
          "updated": "2025-10-28T04:39:01Z",
          "releaseNotes": "Thanks for playing Pikmin Bloom! New in this version:\n\n- You can now set rewards animation for Event Challenges to play automatically.\n- Minor improvements and bug fixes.\n\n*Please download the latest version of the app from the store for the changes above to be reflected.",
          "app_id": "1556357398"
        },
        "Dark War:Survival": {
          "version": "1.250.619",
          "updated": "2025-10-24T09:55:34Z",
          "releaseNotes": "[Adjustments & Optimizations]\n\n[State of Supremacy]\n- Points adjustment during the Invasion Right contest phase\nBefore: Successfully seize the enemy State Dark Syndicate Truck once\nAfter: Escort an S-Tier Dark Syndicate Truck once (points awarded based on whether it is plundered).\n\n[Capital Clash]\nAdjustments for point acquisition ways: \n- Garrison the Capital\n- Garrison Turrets\n- Kill enemy units at the Capital\n- Suffer severe injuries or unit losses at the Capital\n- Kill units during turret battles\n- Suffer severe injuries or unit losses during turret battles\n\n[Territory Triumph]\n- Added the [Schedule War] feature. Alliance members can view scheduled information in the event interface.\n- Once the scheduled time is reached, the war will automatically start.\n- Cities with scheduled war plans can still be attacked immediately.\n\n[Zombie Siege]\n- When the event time conflicts with [Blood Moon Shroud], a secondary confirmation prompt will appear.\n- Each season will feature zombies with different themed appearances.\n\n[Other Improvements]\n- Chat channels now support recalling text and images sent within 2 minutes.\n- [Allied Power] now allows viewing of daily refreshable exclusive tasks.\n- After zooming the world map, survivors can still view the [Peace Shield] status of shelters.",
          "app_id": "6670441558"
        },
        "Travel Town - Merge Adventure": {
          "version": "2.12.1280",
          "updated": "2025-10-19T12:36:34Z",
          "releaseNotes": "Welcome to the latest update of Travel Town!\nWe’ve been busy improving the game and addressing bugs for you. \nEnjoy!",
          "app_id": "1521236603"
        },
        "劍士物語-呼吸奧義": {
          "version": "1.3",
          "updated": "2025-10-16T03:58:37Z",
          "releaseNotes": "fix some bugs",
          "app_id": "6752481184"
        },
        "夢想小鎮 (Township)": {
          "version": "31.0.0",
          "updated": "2025-10-14T10:15:05Z",
          "releaseNotes": "Get ready for a new update!\nNew adventures in Township!\n\nSeason Adventures\n* Gatsby-era fashion and medieval nobility are coming to Township! Decorate your town and win valuable resources in the Gatsby Pass and Knight Pass!\n\nThrilling new expeditions\n* While searching for traces of Vikings, Richard and Rachel end up captured by them and must fight off a mysterious monster!\n* Richard, Ellen, and Alicia take part in filming an exciting Thanksgiving TV show!\n\nNew card collection\n* Collect cards from the Winter Collection to get a unique badge and other prizes!\n\nAlso\n* Halloween and Black Friday sales\n* Travel to Loch Ness and Santa's home in new regatta seasons!\n* Enjoy new buildings—a yoga center and a spiral complex!",
          "app_id": "638689075"
        },
        "單線方塊填充益智遊戲": {
          "version": "1.0.5",
          "updated": "2025-10-28T14:01:29Z",
          "releaseNotes": "Optimized Game Experience",
          "app_id": "6748683699"
        },
        "Dice Dreams™": {
          "version": "1.98.0",
          "updated": "2025-10-16T08:55:42Z",
          "releaseNotes": "Thanks for playing Dice Dreams! We are working hard to improve the game with every release.\n\nIn this version, we've added a variety of updates and improvements to enhance your experience.\n\nWe hope you enjoy the game!",
          "app_id": "1484468651"
        },
        "Pokémon GO": {
          "version": "0.385.0",
          "updated": "2025-10-27T17:23:13Z",
          "releaseNotes": "Trainers, we hope you’re enjoying your adventure in Pokémon GO! We update the app regularly with new events and features, so make sure to check the in-game News to stay up to date.",
          "app_id": "1094591345"
        },
        "Clash Royale": {
          "version": "12.169.18",
          "updated": "2025-10-17T07:22:03Z",
          "releaseNotes": "New update: CLASH-O-WEEN IS BACK!\n• NEW EVOLUTIONS:\n• Skeleton Army – A General rises to lead the swarm.\n• Royal Ghost – Summons Souldiers to fight by his side.\n• NEW LUCKY CHESTS: Special Chests packed with seasonal content - Cards, Cosmetics, and Evolution Shards.\n• MERGE TACTICS: New Rulers enter the Arena and the roster expands with powerful Troops like Wizard, Witch, Electro Wizard, and more.\n• Plus, bug fixes and improvements to keep battles running smoothly",
          "app_id": "1053012308"
        },
        "Family Style: Co-op Kitchen": {
          "version": "1.8.0",
          "updated": "2021-08-10T11:46:20Z",
          "releaseNotes": "- Fixed several crashes on start-up",
          "app_id": "1484208629"
        },
        "野蠻生存錄：侏羅紀": {
          "version": "1.3.369",
          "updated": "2025-10-24T06:49:46Z",
          "releaseNotes": "[New Content]\n1. Turkish is now available.\n\n[Optimizations & Adjustments]\n1. Minimum price for new listings set to 100,000 in Auction Harbor.\n2. Improved task sequence for better flow in Chief of the Continent.\n\n[Other Changes]\n1. Outside squads returning, and Clan under attack notification added\n2. Chief Skill Immediate Return new alert added\n3. Building Contribution optimized",
          "app_id": "6737189862"
        }
      }
    }
  }
}