{
  "US": {
    "ios": {
      "top_grossing": {
        "MONOPOLY GO!": {
          "version": "1.60.0",
          "updated": "2025-12-11T11:26:38Z",
          "releaseNotes": "The Harry Potter GO! Album has arrived, let the magic begin!\nExplore a magical themed board\nPlay the Snitch Chase for special rewards\nEarn Chocolate Frogs and collect enchanting Stickers\nJoin the Quidditch Racers event and ride your broomstick to victory!\nUpdate now and start collecting the magic!",
          "app_id": "1621328561"
        },
        "Royal Match": {
          "version": "32672",
          "updated": "2025-12-08T08:00:23Z",
          "releaseNotes": "Are you ready for a challenging new update?\n\n• Get ready for amazing 100 NEW LEVELS! Fun and exciting new challenges are waiting for you!\n\n• Explore the NEW AREA! Open the doors to timeless elegance in the ROYAL WARDROBE!\n\nNew levels are coming in every two weeks! Be sure to update your game to get the latest content!",
          "app_id": "1482155847"
        },
        "Last War:Survival": {
          "version": "1.0.324",
          "updated": "2025-12-10T10:27:04Z",
          "releaseNotes": "1. Adjusted the rarity of the [5000 Diamond] item to UR (Gold).\n2. Optimized the text of some building descriptions in the Building List.",
          "app_id": "6448786147"
        },
        "Candy Crush Saga": {
          "version": "1.317.1.2",
          "updated": "2025-12-09T07:14:52Z",
          "releaseNotes": "We hope you’re having fun playing Candy Crush Saga! \n\nWe update the game every week with sweet new features, exciting levels, and important bug fixes to keep everything running smoothly. \n\nDon't forget to download the latest version for the best experience!\n\nNew to the game? Don’t be shy, join the fun!",
          "app_id": "553834731"
        },
        "Whiteout Survival": {
          "version": "1.28.18",
          "updated": "2025-10-22T07:06:00Z",
          "releaseNotes": "[New Content]\n1. New Feature: Tundra Album. Forge your legend in the icy realm! Gather Scene Fragments scattered across the tundra. And piece them together into spectacular scenes. Relive the timeless legends of the frost-bound era and make history yourself!\n2. New Feature: Leading Glory system. Each time your state qualifies as a Leading State during State Transfer, it will receive a Leading Emblem. The Leading Emblems can be used to unlock exclusive rewards such as Sunfire Castle Shield Skin, State Transfer Event State Name Card, Sunfire Castle Skin and Turret Skin, and Exclusive State Title. Stay proud of your state!\n3. New Event: Dead Shot When participating in regular events, you have a chance of earning \"Shotchits\". You can use the \"Shotchits\" to play a shooting game. Hit the bullseye for bountiful rewards! Every 2 \"Chest Keys\" collected can be used to open a chest that contains extra bonuses. By spending enough Shotchits, you can unlock the exclusive Action Emote: Hit!\n\n[Optimization & Adjustment]\n1. Bear Hunt: Added the Auto-Register feature, which automatically starts a Bear Hunt based on the last opening time once the cooldown ends.\n2. Castle Battle: Reduced the battle duration to 5 hours and the required occupation time for victory to 2.5 hours, without changing the battlefield opening hours.\n3. Daybreak Island: Added a new basic decoration, \"Marble Fence\". Introduced the Like History feature, allowing you to view likes from other Chiefs.\n4. Lighthouse Intel: Upon reaching Furnace Lv. 15 or VIP Lv. 5, you will unlock the \"Claim All\" feature for claiming your Intel rewards.\n5. Alliance Championship: Added the \"Batch-Adjust\" feature to the troop info page, allowing R4 or higher officers to adjust lanes more efficiently.\n6. Teleport: While using a \"Territory Teleporter\", you can freely adjust and select your target location before confirmation. If your target location is within your Alliance territory, \"Territory Teleporters\" will be used first.\n7. Snowbusters:\na. Increased Fuel consumption and rewards for snow clearing (numerical adjustments only without changing the overall rewards). After a certain levels, monsters in an area can drop multiple Snowbuster Maps.\nb. Added a feature that allows you to exchange Fuel for Rockets after clearing Area 16.\nc. Added the Raid feature, which becomes available once you reach Area 24. You will be able to clear stages quickly by spending Fuel.\nd. Snowbusters Pass Optimization: Using Rockets now grants Snow Points. \n8. Chief Gear: When your state age reaches a certain number of days, we will introduce T4 Legendary Gear (3-Star) and expand the sources for Chief Gear enhancement materials. The details are as follows:\na. Labyrinth Shop: \"Chief Gear Materials Chest\" will become available.\nb. Alliance Championship Shop: The weekly purchase limit for \"Polishing Solution\", \"Design Plan\", and \"Hardened Alloy\" will be increased.\nc. Crazy Joe: Personal Ranking Rewards and Alliance Ranking Rewards will be updated.\n9. Frostdragon Tyrant: Introduced State Rewards for all Chiefs at Furnace Lv. 20 or higher in the states of the top 10 Chiefs on the Occupation Ranking. Additionally, the Tyrant’s Gift will now appear at a random location near the Sunfire Castle instead of a fixed position.\n10. Tundra Arms League: Introduced rank-determined State Rewards for all Chiefs at Furnace Lv. 20 or higher in the states of the top 4 Legions, which can be claimed manually.\n11. Foundry Battle: After occupying a building for 30 minutes in Foundry Battle and Tundra Arms League, you will gain Personal Points much faster.\n12. Mercenary Prestige: When your state unlocks Fire Crystal Lv. 8, a new type of Legend's Initiation will be introduced, and the current one will be renamed as Epic Initiation.\n13. The Labyrinth: Introduced the Alliance Member Leaderboard, allowing you to view your allies' performances.",
          "app_id": "6443575749"
        },
        "Kingshot": {
          "version": "1.7.12",
          "updated": "2025-10-28T07:10:55Z",
          "releaseNotes": "[New Content]\n1. New Feature: Mystic Trial. A brand-new adventure awaits! \n2. New Feature: Leading Glory. During Kingdom Transfer, your Kingdom will receive a Leading Emblem each time it qualifies as a Leading Kingdom. Accumulate Leading Emblems to unlock special Leading Glory skins. Show off your Kingdom's dominance!\n3. New Feature: Mood Status. Set a status to let others know how you're feeling, making social interactions more fun and personal.",
          "app_id": "6739554056"
        },
        "Gossip Harbor®: Merge & Story": {
          "version": "3.79.0",
          "updated": "2025-12-03T02:21:14Z",
          "releaseNotes": "NEW EPISODE EVERY FRIDAY!\n- NEW EPISODE: With new chapter updates every Friday; follow Quinn as she exposes secrets and solves puzzles.\n- NEW EVENT:Visit Hollybell Hollow to experience the snowglobe festival and unlock the Fraser Fir Lodge! Join Sam, Mark, and Quinn as they explore a quaint arctic village. Explore by collecting points and unlock exclusive decorations to complete the event.",
          "app_id": "1623318294"
        },
        "Clash Royale": {
          "version": "13.300.6",
          "updated": "2025-11-26T08:06:47Z",
          "releaseNotes": "New Update: THE RISE OF HEROES!\n• NEW HEROES: Knight, Giant, Musketeer, and Mini P.E.K.K.A gain powerful new abilities!\n• NEW BOXES: Collect Hero Fragments and Evolution Shards in the new Hero and Evolution Boxes\n• NEW CURRENCY: Introducing Crystals - earn and spend these beauties on exclusive cosmetics!\n• TROPHY ROAD & RANKED REWORK: More Arenas, smoother progression, and easier access to Ranked\n• PROGRESSION CHANGES: Now a simpler system with the removal of Elite Wild Cards, Books, and Magic Coins - and the addition of Level 16\n• MERGE TACTICS: New Rulers, troops, and modifiers enter the Arena, while others take a career break\n• Plus bug fixes and improvements",
          "app_id": "1053012308"
        },
        "Township": {
          "version": "32.1.0",
          "updated": "2025-12-10T11:00:08Z",
          "releaseNotes": "\"Get ready for a new update!\nWhat's new in Township!\n\nNew Card Collection\n* Sights, traditions, and curiosities from all over the world await you in the new Journey Collection! Collect all the cards to get a unique badge and other prizes!\n\nSeason Adventures\n* We're celebrating Christmas, and then we're off to France! With the Christmas and French Passes, you can win resources to develop and decorate your town!\n\nThrilling New Adventures\n* The Adventurers' Society is in danger! Can Richard, Rachel, and Zoe stop the villain?\n* A walk in the mountains turns into a rescue mission for Richard and Rachel in the middle of a raging blizzard!\n\n* Easy Navigation\nFilling orders just got easier! Tap the magnifying glass to go to the factory you need, and you'll automatically return to your orders when you close the window.\n\nAlso\n* A new match-3 element—Piñata!\n* A challenge on the northern seas in the new regatta season!\n* A new community building—Ice Arena!\"",
          "app_id": "638689075"
        },
        "Royal Kingdom": {
          "version": "23943",
          "updated": "2025-12-01T08:00:50Z",
          "releaseNotes": "Get ready for a shiny new update!\n\n• Prepare yourself for 100 NEW LEVELS! Experience fun and exciting challenges!\n\n• Explore the new district, LOTUS GARDEN! Keep expanding the kingdom to discover new horizons!\n\nPlay Royal Kingdom now!",
          "app_id": "1606549505"
        },
        "Last Z: Survival Shooter": {
          "version": "1.250.688",
          "updated": "2025-12-10T15:30:49Z",
          "releaseNotes": "fix bug",
          "app_id": "6503272652"
        },
        "Toon Blast": {
          "version": "20481",
          "updated": "2025-12-09T12:56:15Z",
          "releaseNotes": "PLAY 50 NEW LEVELS!\nToon Blast introduces the Oops! Tangled! episode with 50 new levels!\nBe sure to update to the current version of Toon Blast for the newest content.\nCome and join the fun!",
          "app_id": "1176027022"
        },
        "Match Factory!": {
          "version": "1.56.383",
          "updated": "2025-12-02T13:25:30Z",
          "releaseNotes": "• NEW PACK: Lucky Win\n\n• NEW FEATURE: Collection\nCollect Cards, complete Sets and get the Grand Prize!\n\nNew items are coming every 2 weeks! Be sure to update your game to get the latest content!",
          "app_id": "6449094229"
        },
        "Clash of Clans": {
          "version": "18.0.5",
          "updated": "2025-11-24T11:32:09Z",
          "releaseNotes": "Town Hall 18 Crash Lands!\n· Town Hall 18 makes an impact! Guardians are here to revolutionize your defense setup!\n· The Revenge Tower and Super Wizard Tower are a duo of delightful new defenses.\n· Crafting Phase 2 is here! Enjoy new Crafted Defenses: Hero Bell, Bomb Hive, and Light Beam.\n· The Fancy Shop opens for business! Earn Sparky Stones for upgrading Crafted Defenses and Supercharging buildings to unlock unique rewards.",
          "app_id": "529479190"
        },
        "Homescapes": {
          "version": "8.4.10",
          "updated": "2025-12-04T12:46:11Z",
          "releaseNotes": "A magical Homescapes update is here!\n\nSECRETS OF THE SCHOOL OF MAGIC\n• Go to the School of Magic with Austin and a young sorceress!\n• Save the magical world from sinister Dark Guardians!\n• Complete the event to get valuable rewards!\n\nA SHADOW OVER CHRISTMAS\n• Go on a Christmas adventure with Austin and his family!\n• Pass Krampus's trials to save the long-awaited holiday!\n• Complete the event to get valuable rewards!\n\nALSO\n• A new chapter: Broom Bakery! Will Stephanie Broom pull off opening the best café in town?",
          "app_id": "1195621598"
        },
        "Gardenscapes": {
          "version": "9.2.2",
          "updated": "2025-11-27T19:45:27Z",
          "releaseNotes": "An intriguing Gardenscapes update!\nNEW EVENTS\nA Puzzling Inheritance: Uncover the secret of the family heirlooms and find Mycroft's treasure!\nChristmas with the Parents: Help Katherine and Austin reach a mountain lodge in time for Christmas!\n\nSTORYLINE\nFind out if Austin and friends can solve the mystery of the truth serum!",
          "app_id": "1105855019"
        },
        "Coin Master": {
          "version": "3.5.2340",
          "updated": "2025-12-08T15:25:46Z",
          "releaseNotes": "Thanks for playing Coin Master!\n\nIn this version, we’ve implemented bug fixes & performance improvements.\n\nWe have also implemented our new reward calendar feature - collect your daily rewards! \n\nEnjoy a world of fun, thrills, and huge rewards right at your fingertips. \n\nInvite your friends to play Coin Master & get your FREE REWARDS! We also recommend joining our community on Facebook, Twitter, and Instagram for more fun & excitement.\n\nEnjoying Coin Master? Leave a review :)",
          "app_id": "406889139"
        },
        "Pokémon GO": {
          "version": "0.391.0",
          "updated": "2025-12-11T20:25:19Z",
          "releaseNotes": "Trainers, we hope you’re enjoying your adventure in Pokémon GO! We update the app regularly with new events and features, so make sure to check the in-game News to stay up to date.",
          "app_id": "1094591345"
        },
        "Call of Duty®: Mobile": {
          "version": "1.0.53",
          "updated": "2025-12-08T03:15:30Z",
          "releaseNotes": "Call of Duty®: Mobile Season 11: 6th Anniversary is here! It’s our party—lock and load! Jump into DMZ: Recon, clash with the Street Fighter 6 content, and celebrate the fight that never ends. \n\nDMZ: Recon \nEnter DMZ: Recon, where every run is a test of instinct and endurance. Build your loadout, complete objectives, and battle hostiles and rival squads for valuable loot. Push deeper with every extraction to stack rewards, upgrade your gear, and dominate the battlefield. In DMZ: Recon, every player shapes their own path — adapt, outplay, and own every run. \n\nStreet Fighter 6 x CODM \nNew challengers have entered the fight in CODM! Suit up as Operators inspired by Chun-Li, Akuma, Ryu, and Cammy, each bringing signature finishers, emotes, and themed weapons to the fight. Complete the collection to wield the SMRS – Hadouken, Ryu’s legendary move reimagined for CODM. \n\nPlay to unlock even more Street Fighter 6 content — Demir – Luke and unique rewards await in the Secret Cache. \n\n6th Anniversary \nAnother year in the books, and CODM keeps evolving. Celebrate with us — vote for your favorite skins, take part in anniversary events, and discover Serpent Island in DMZ: Recon, where the party (and the cake) await. \n\nDouble COD Points \nEarn 2X COD Points when you buy now! Stock up in-game while the deal lasts and claim your favorite Street Fighter 6 content. Don’t wait — this offer ends January 19 (UTC)! \n\nSecret Cache Legendary Refresh \nAlongside the Street Fighter 6 rewards arriving in the Secret Cache, a new Legendary is dropping! Unlock the Striker – Source Code and erase your enemies into the digital abyss. \n\nNEW BATTLE PASSES \n’Tis the season to suit up with your favorite holiday Operators! The Season 11 Battle Pass is packed with winter-wonderland rewards to get you in the spirit. Earn free gear like the new SO-14 Marksman Rifle, or go Premium to unlock Ajax – Muay Claus. Naughty or nice, every tier’s a gift worth unwrapping! \n\nNEW BATTLE PASS VAULTS \nSix years strong, and the journey continues! Over time, we’ve delivered some unforgettable Battle Passes, and in Season 11, we’re unlocking the Vault to bring back three fan-favorite classics: New Order (2021), HEIST (2022), and Siren Song (2023). Grab them before they’re gone—and stay tuned. The road to 7 years has even more favorites waiting to return. \n\nThis season, we’re raising the bar — so celebrate with us as we take Call of Duty: Mobile to the next level and beyond. Here’s to six years of action… and the fight ahead!",
          "app_id": "1287282214"
        },
        "Dark War:Survival": {
          "version": "1.250.626",
          "updated": "2025-12-12T09:17:15Z",
          "releaseNotes": "[Main Screen]\n- Streamlined the World main interface to expand combat operation space: Removed the left sidebar. Troop information is now permanently displayed in the lower right corner.\n- Two new settings added under [Avatar → Settings → General Settings]: [Drag troop avatars on the main screen to control troops] and [Return button visibility next to troops]. Used to enable/disable troop control via dragging avatars and toggling the visibility of the return button next to troops.\n- Scout troops now display both march and return time.\n- Increased spacing between the 4 march queues on the right side to reduce accidental taps.\n- Added a [Rally] button to the left of the right-side march queues for quick access to the rally interface.\n- The rally prompt bubble no longer pops up at the bottom left of the main screen when eligible for auto-join rallies.\n- Removed the quick-jump bubble on Saturdays during the Alliance Duel [Enemy Buster].\n\n[MutaBeast Hunt]\n- After locating a MutaBeast, it will disappear if not defeated within 30 minutes. Survivors must search again (re-searching does not reset progress).\n- After the event starts, the event bubble at the bottom of the main interface will display the current hunt progress.\n\n[Chat]\n- Using the [Reply] function will now automatically @ the other survivor.\n- Tap the area above the reply box to see the original text, with translation available.\nYou can choose to add the survivor to your blacklist when reporting them.\n\n[Combat Experience]\n1. Experimental Feature\n- A new [Experimental Feature] buff will be active on the days when [Alliance Duel] Enemy Buster, [State of Supremacy], and [Capital Clash] events begin.\n- While the [Experimental Feature] buff is active, unit losses from attacking shelters will be reduced by 50%.\n- The [Experimental Feature] is currently in beta testing. We welcome survivors to share your honest feedback with us through [Support].\n\n2. World Battles\n- Improved the selection logic for shelter buildings on the World Map, making it easier to select a shelter when dragging troops.\n- Optimized the floating text display during combat, and hidden the floating text for buffs in battle.\n- Improved the burning visual effects on shelters when wall durability decreases.\n\n[Others]\n- In [Black Gold Battlefield], battle results for Team B will be sent to all alliance members after the fight ends.\n- [MutaBeast Hunt]\n- When promoting units, the number of remaining units at that level will now be displayed below the unit icon.\n- Optimized the visual presentation of the [Shadow Calls] event.\n- Adjusted the display image on the Hero Exclusive Equipment Pack interface to show the corresponding exclusive equipment.\n- Ruby-type items have been moved from the [Resources] tab to the [Special] tab in the inventory.\n- Survivors earn rewards each time they unlock a new section of the Apocalypse Guide.",
          "app_id": "6670441558"
        },
        "Total Battle: Strategy Game": {
          "version": "340.7.33",
          "updated": "2025-12-08T09:02:48Z",
          "releaseNotes": "Bug fixes and stability improvements.\nWe would be happy to hear your feedback and suggestions. Please send them to support@totalbattle.com",
          "app_id": "1274132545"
        },
        "Fishdom": {
          "version": "9.4.2",
          "updated": "2025-12-01T16:08:53Z",
          "releaseNotes": "Check out Fishdom's winter update!\nTHE WARMTH OF WINTER WONDERS!\n- Collect all the holiday cards in the Winter Collection and recreate the magic of winter in your aquariums!\n- Embark on the Saving Christmas expedition and help bring back the magic of the holidays!\n- Restore a farm in the Farm Adventures expedition and reap a harvest of rewards for your hard work!\nALSO\nNew aquarium: Mystery of the Nautilus\nNew fish: Sparrow Fish and Scarlet Betta\nEnjoy the game!",
          "app_id": "664575829"
        },
        "Evony": {
          "version": "5.14.2",
          "updated": "2025-12-10T01:56:43Z",
          "releaseNotes": "- Bug fixes and improvements",
          "app_id": "1098157959"
        },
        "Travel Town - Merge Adventure": {
          "version": "2.12.1350",
          "updated": "2025-12-09T12:23:35Z",
          "releaseNotes": "Welcome to the latest update of Travel Town!\nWe’ve been busy improving the game and addressing bugs for you. \nEnjoy!",
          "app_id": "1521236603"
        },
        "Free Fire": {
          "version": "1.118.1",
          "updated": "2025-10-29T03:30:18Z",
          "releaseNotes": "[Flame Arena] Step into the inferno as the flames close in. The strongest will claim victory.\n[New Loadouts] 4 fresh loadouts to mix and match for ultimate team strategy.\n[New Character - Nero] Be careful not to enter and get lost in the dream space this dreamsmith creates.\n[New Weapon - Winchester] A full-auto marksman rifle with 2-round firing and high mobility, an excellent pick for long‑range combat.\n[Social Island in Custom Room] Create your own hangout and invite friends to party together.",
          "app_id": "1300146617"
        },
        "Lightning Link Casino Slots": {
          "version": "9.7.0",
          "updated": "2025-11-26T10:51:24Z",
          "releaseNotes": "Thank you for playing Lightning Link Casino!\n\nNew amazing slots are on their way for you to enjoy! Stay tuned for more amazing events, seasons and coins to be won.\n\nWe hope you enjoy Lightning Link Casino!",
          "app_id": "1243005112"
        },
        "Pokémon TCG Pocket": {
          "version": "1.4.1",
          "updated": "2025-11-18T01:00:13Z",
          "releaseNotes": "Bug Fixes",
          "app_id": "6479970832"
        },
        "DRAGON BALL LEGENDS": {
          "version": "6.15.0",
          "updated": "2025-12-09T09:31:22Z",
          "releaseNotes": "【Issues Fixed】\n- Fixed various bugs",
          "app_id": "1358222641"
        },
        "Jackpot Party - Casino Slots": {
          "version": "5065.00",
          "updated": "2025-11-13T23:23:29Z",
          "releaseNotes": "Hey, partiers! Get ready to take your slot-playing journey to the next level with our newest update! Download the latest version today and dive into a brand new Jackpot Party experience, including new collectable feature Party Cards, and see where you rank with Leaderboards!",
          "app_id": "575980917"
        },
        "Cashman Casino Slots Games": {
          "version": "4.2.0",
          "updated": "2025-12-03T10:53:48Z",
          "releaseNotes": "Hey Mr. Cashman fans!\nGet our NEW games in our latest update!\nFor the best experience and most FUN we’ve squashed bugs and optimized your game.\nBecome a fan today using the following link to get daily bonuses and updates:\nhttps://www.facebook.com/cashmancasino/",
          "app_id": "1123582513"
        },
        "Top Heroes: Kingdom Saga": {
          "version": "1.83.14",
          "updated": "2025-12-09T02:49:32Z",
          "releaseNotes": "A new Wyvern Racing event launches: lords can wield cards and wyverns to race opponents in high-speed duels, tearing through the clouds and cutting the wind, pushing past all limits — victors will return lauded as legends!",
          "app_id": "6450953550"
        },
        "Screwdom": {
          "version": "9.0.0",
          "updated": "2025-12-13T10:13:10Z",
          "releaseNotes": "New Features: Leaderboard & Weekly Contest – Compete with other players, climb the rankings, and earn exciting weekly rewards!",
          "app_id": "6740043080"
        },
        "Magic Sort!": {
          "version": "18.25",
          "updated": "2025-12-01T16:30:16Z",
          "releaseNotes": "Are you ready for a magical new update?\n\n-New 100 levels!\n-Bug Fixes & Improvements\n\nEnjoy!",
          "app_id": "6499209744"
        },
        "Color Block Jam": {
          "version": "1.32.1",
          "updated": "2025-12-12T06:24:53Z",
          "releaseNotes": "A small glow-up\nOur game icon just got a clean new upgrade. Spot us easier than ever!",
          "app_id": "6504332779"
        },
        "MapleStory : Idle RPG": {
          "version": "1.2.0",
          "updated": "2025-11-26T19:17:24Z",
          "releaseNotes": "▶ New Party Quest: Dimensional Crack\n▶ Guild War added\n▶ New event added",
          "app_id": "6739616715"
        },
        "Candy Crush Soda Saga": {
          "version": "1.308.3",
          "updated": "2025-12-09T07:59:39Z",
          "releaseNotes": "Sodalicious! We update our game every week with exciting levels, improvements to the game, and fun new features. Download the latest version to check it out!\nJoining us after a break? Welcome back! New to the game? You’ll be a pro before you know it!\n\nWhat are you waiting for? Let’s play!",
          "app_id": "850417475"
        },
        "Disney Solitaire": {
          "version": "1.10.2",
          "updated": "2025-12-10T10:46:54Z",
          "releaseNotes": "Get ready for an amazing update!\n* Prepare for NEW levels!\n* Unlock NEW Disney characters!\n* Join the magic with NEW DISNEY FEATURES!\n* Enjoy performance improvements for a smoother gaming experience!\nPlay Disney Solitaire!",
          "app_id": "6475757306"
        },
        "All in Hole: Black Hole Games": {
          "version": "6.3.2",
          "updated": "2025-12-01T15:40:26Z",
          "releaseNotes": "NEW PACKS WITH FRESH LEVELS!\n\nNov 24 – THANKSGIVING Pack: Celebrate the harvest in 100 festive and flavorful levels!\nDec 08 – MUSIC STUDIO Pack: Hit the right notes in 100 instrument-filled levels!\nDec 22 – HOCKEY Pack: Lace up and glide through 100 icy, holiday-spirited levels!\n\nAnd don’t miss the new TREASURE PASS season starting Dec 1!\n\nUpdate regularly so you never miss fresh levels, events & surprises!",
          "app_id": "6503284107"
        },
        "Tasty Travels: Merge Game": {
          "version": "44.0",
          "updated": "2025-12-10T09:27:46Z",
          "releaseNotes": "- Minor bug fixes and improvements",
          "app_id": "6471045672"
        },
        "Marvel Contest of Champions": {
          "version": "54.0.0",
          "updated": "2025-12-08T17:01:06Z",
          "releaseNotes": "THE CONTEST TURNS 11! \nJoin us this month as we celebrate our charming Champions and sensational Summoners!\n\nNEW CHAMPION\n\nImperiosa\nNot only the pinnacle of Eidol creation, but also the combined genius of every Founder who ever lived, Imperiosa is a vessel that contains the Founders' brilliance, cruelty, and will to dominate. Inhabiting a body composed of billions of tiny, synthetic ISO-based organisms, Imperiosa is able to rearrange these \"\"Synthects\"\" into a myriad of useful forms and functions depending on the situation. Additionally, Synthects can disassemble matter around them, providing raw materials to replicate themselves without limit. Though a hive mind, Imperiosa manifests as one voice speaking with absolute authority; an icon of the vile past, volatile present, and violent future of The Founders.\n\n\nCHAMPION UPDATES\n\n\nPunisher \nPunisher can handle some punishment before dishing it out. Indestructible and Physical Resistance are prominent once again.\nCritical Hits and Bleeding out his Opponent make their return.\nVillain's will fear his Impact, shredding their block with a Special 2 Attack.\n\nWolverine (X-23) \nLaura is back and she's ready to take down the competition with a Frenzy fueled rework.\nHer aggressive playstyle focuses around striking her opponent to build up Frenzy, and eviscerating them with a flurry of attacks.\nLaura's powerful Bleed Passives take things a step further when she taps into her instincts. Watch out!\n\n\nNEW FEATURES\n\n\nAlliance Coliseum\nIs your Alliance ready for a new kind of challenge? Enter The Coliseum and see how many health bars you can deplete from your opponent, then compare scores with your Alliance mates to work out which attackers are best suited for the fight. Match your Champion with the correct daily bonus tags and level up your Podiums in order to score as high as possible and take your Alliance to the top!\n\nNEW QUESTS AND EVENTS\n\n\nBanquet Event - Asgardian Gala\nNo matter which of the nine-realms you call home, it is time for merry-making and feasting! So warriors such as Jane Foster and Valkyrie invite one and all to make the most out of this celebration as they prepare for battle against the invading Eidols. FEAST on resources, CELEBRATE with Summoners, and make merry... while you can.\nFeaturing our annual anniversary celebrations, Accolades Event, New Years ‘Ring it in’ Arenas and Glorious Guardians, this Banquet Event is not one to be missed! Get your first opportunity to acquire newly 7-Star Champions such as  Absorbing Man, Valkyrie, Scorpion, Kingpin, Punisher, and Super-Skrull during this Event!\n\n\nEvent Quest - Lost And Found\nThe final Eidol, IMPERIOSA has arrived and with them comes no shortage of destruction and danger. Power is draining from ISO-8, foes are assembling, but possible friends are also revealing themselves. Will all the Eidols fall in line once the secrets of the Founders are revealed? Or will Imperiosa’s downfall be a result of Eidol handywork?\n\nSide Quest - Taken\nEidol invaders are taking over The Contest, and it has inspired The Collector into action. The Collector has a particular set of Skills (as well as Mutants, Sciences, and Techs). He had been attempting to take control over some Champions but 11 years of ISO-radiation and an ever-changing roster has perhaps left his skills of super-powered manipulation a little rusty. So now it’s up to The Summoner to break some violent brainwashing of a dozen Champions who have TAKEN a leave of their senses!\n\nAll this and more! Check out the complete list of exciting updates on playcontestofchampions.com",
          "app_id": "896112560"
        },
        "Bingo Blitz™ - BINGO Games": {
          "version": "5.85.1",
          "updated": "2025-12-06T12:55:00Z",
          "releaseNotes": "Thank you for being part of the Bingo Blitz community! Discover new bingo rooms, in-game events, celebrations and above all: The BEST Bingo experience! Let's BinGo!",
          "app_id": "529996768"
        },
        "Age of Origins:Tower Defense": {
          "version": "1.3.816",
          "updated": "2025-12-12T09:23:44Z",
          "releaseNotes": "Optimized some of the game play.",
          "app_id": "1376515087"
        },
        "CookieRun: Kingdom": {
          "version": "6.11.201",
          "updated": "2025-12-03T01:07:43Z",
          "releaseNotes": "- Wicked x CookieRun: Kingdom Update\n- New: Elphaba Cookie (SPECIAL) and Glinda Cookie (SPECIAL)\n- Bug fixes and QoL improvements",
          "app_id": "1509450845"
        },
        "Merge Cooking®": {
          "version": "1.20.0",
          "updated": "2025-12-08T04:43:17Z",
          "releaseNotes": "Welcome back, Chef!\nA new version of Merge Cooking is available!\nTo provide a better experience, we're working hard to optimize the game performance as well as bring you exciting content.\nWe hope you can enjoy the time playing!\nNew to the game? Don't worry. We've prepared step-by-step instructions to guide you through. Join us and have some fun.",
          "app_id": "1643509748"
        },
        "X-Clash: Survival Challenge": {
          "version": "1.0.35",
          "updated": "2025-12-12T01:53:00Z",
          "releaseNotes": "[Bug Fixes]\n- Fixed an issue where the red dot on Union Gifts would not disappear in certain cases.\n- Fixed an issue where a failed auto-moderation of custom avatars could prevent players from changing their avatars.\n- Fixed an issue where Castle Skin CP might display incorrectly after relogging.\n- Fixed an issue where wagon dispatch record count displayed abnormally in some cases.",
          "app_id": "6744812012"
        },
        "Big Fish Casino: Slots Games": {
          "version": "19.8.60",
          "updated": "2025-11-26T09:13:26Z",
          "releaseNotes": "CELEBRATE the start of AUTUMN! Exclusive sales and events are happening all month long!\n\n* NEW SLOTS! Fú Lún, Magic Spark, & Firecracker Fortunes!\n* BUG FIXES! We’re always on the lookout for pesky bugs and have also made some performance fixes.\n* FREEBIES! Check us out on Facebook & Instagram for daily FREE CHIPS, as well as important updates!",
          "app_id": "538212549"
        },
        "Quick Hit Slots - Vegas Casino": {
          "version": "3.65.00",
          "updated": "2025-11-14T18:28:23Z",
          "releaseNotes": "It’s time to get ready for the Holiday Season with Quick Hit Slots!\n \n- Join the Greenwoods with our NEWEST COLLECTIONS SEASON – Family Trip!\n- Make the most of your QUICK HIT REWARDS’ POINTS before they reset!\n- SCRATCH CARDS are coming to Quick Hit Slots!\n- SWEEPS ROYALE is here to bring you SPECIAL REWARDS!\n- Plus - AMAZING PROMOTIONS for Thanksgiving & Christmas!\n\nDOWNLOAD & UPDATE NOW!",
          "app_id": "945621521"
        },
        "Seaside Escape®: Merge & Story": {
          "version": "1.86.0",
          "updated": "2025-12-09T21:26:08Z",
          "releaseNotes": "NEW CONTENT EVERY WEEK \n- Locations! Unlock a new location and its secrets!\n- Events! Spice up your gaming experience with this weeks' event!\n\nWe've also fixed bugs and added cool new features!",
          "app_id": "6443755785"
        },
        "Chess - Play & Learn Online": {
          "version": "4.9.27",
          "updated": "2025-12-09T18:58:24Z",
          "releaseNotes": "Hi chess fans! Today's new version improves app quality, removing a couple of bugs that could cause the app to crash. We hope you enjoy it! Thank you.",
          "app_id": "329218549"
        },
        "Toy Blast": {
          "version": "22738",
          "updated": "2025-12-01T08:04:02Z",
          "releaseNotes": "There is an update from space!\n\nThe peaceful farm life has been interrupted, THE ALIENS are HERE! Watch out for the green lights and flying cows! Join this out-of-world update and see what the toys are up against!\n\nBe sure to update the current version of Toy Blast for the newest content. Every 2 weeks, we bring 50 NEW LEVELS!\n\nCome and have fun!",
          "app_id": "890378044"
        }
      },
      "top_free": {
        "Solitaire Associations Journey": {
          "version": "1.1.0",
          "updated": "2025-12-05T16:08:04Z",
          "releaseNotes": "Hey there! A new update has arrived!\n\nWe are ready to make your game experience even greater. Bugs have been fixed and game performance optimized. \n\nDon't forget to rate and review!\n\nHave fun!",
          "app_id": "6748950306"
        },
        "Jigsolitaire": {
          "version": "1.0.0",
          "updated": "2025-11-28T02:39:14Z",
          "releaseNotes": "Thank you for playing Jigsolitaire!\nIn this update, we've upgraded our internal libraries to the latest versions, enhancing overall performance and stability. We've also made several small tweaks and minor fixes to ensure a smoother and more enjoyable gameplay experience.\nWe hope you continue to enjoy Jigsolitaire!",
          "app_id": "6741408932"
        },
        "Clash Royale": {
          "version": "13.300.6",
          "updated": "2025-11-26T08:06:47Z",
          "releaseNotes": "New Update: THE RISE OF HEROES!\n• NEW HEROES: Knight, Giant, Musketeer, and Mini P.E.K.K.A gain powerful new abilities!\n• NEW BOXES: Collect Hero Fragments and Evolution Shards in the new Hero and Evolution Boxes\n• NEW CURRENCY: Introducing Crystals - earn and spend these beauties on exclusive cosmetics!\n• TROPHY ROAD & RANKED REWORK: More Arenas, smoother progression, and easier access to Ranked\n• PROGRESSION CHANGES: Now a simpler system with the removal of Elite Wild Cards, Books, and Magic Coins - and the addition of Level 16\n• MERGE TACTICS: New Rulers, troops, and modifiers enter the Arena, while others take a career break\n• Plus bug fixes and improvements",
          "app_id": "1053012308"
        },
        "Block Blast！": {
          "version": "6.6.2",
          "updated": "2025-12-13T02:21:34Z",
          "releaseNotes": "We're always improving Block Blast! Turn on auto-updates to get the latest features.\nSuggestions? Email us: blockblast-support@hungrystudio.com\nFollow us on TikTok for updates: @blockblastofficial",
          "app_id": "1617391485"
        },
        "Fortnite": {
          "version": "39.10",
          "updated": "2025-12-11T09:09:37Z",
          "releaseNotes": "LEGO Fortnite Odyssey - \"Ninjago: Rise of the Ninja\" Update\nHone your skills as a ninja and defend Ninjago Island from invading monsters! Get the Ninjago LEGO Pass featuring the Kai Outfit, Builds, and Decor.\n\nFortnite OG Season 7\nOG takes it back to Chapter 1 Season 7! Battle the Ice King and his frigid legions, zoom around the map on ziplines, and take to the skies on the X-4 Stormwing.",
          "app_id": "6483539426"
        },
        "Imposter - Party Word Game": {
          "version": "3.7.2",
          "updated": "2025-12-06T18:59:42Z",
          "releaseNotes": "Bug fixes and improvements.",
          "app_id": "6745120053"
        },
        "Roblox": {
          "version": "2.702.622",
          "updated": "2025-12-11T22:19:06Z",
          "releaseNotes": "To make Roblox work better for you, we deliver updates regularly. These updates include bug fixes and improvements for speed and reliability.",
          "app_id": "431946152"
        },
        "Netflix Game Controller": {
          "version": "3.0.5",
          "updated": "2025-12-12T14:35:33Z",
          "releaseNotes": "We've squashed bugs and made behind-the-scenes improvements to bring Netflix members the best possible gameplay experience.",
          "app_id": "6447582581"
        },
        "Vita Mahjong": {
          "version": "3.2.1",
          "updated": "2025-12-11T10:50:57Z",
          "releaseNotes": "-Bug fixes and performance improvements.",
          "app_id": "6468921495"
        },
        "Pixel Flow!": {
          "version": "0.12.1",
          "updated": "2025-12-11T08:00:29Z",
          "releaseNotes": "A fresh drop of fun is here! This update adds shiny new levels, better balance, and smoother action. We zapped those sneaky bugs and made everything play like a dream. Ready to jump back in? Let’s go!",
          "app_id": "6751056652"
        },
        "Magic Sort!": {
          "version": "18.25",
          "updated": "2025-12-01T16:30:16Z",
          "releaseNotes": "Are you ready for a magical new update?\n\n-New 100 levels!\n-Bug Fixes & Improvements\n\nEnjoy!",
          "app_id": "6499209744"
        },
        "Township": {
          "version": "32.1.0",
          "updated": "2025-12-10T11:00:08Z",
          "releaseNotes": "\"Get ready for a new update!\nWhat's new in Township!\n\nNew Card Collection\n* Sights, traditions, and curiosities from all over the world await you in the new Journey Collection! Collect all the cards to get a unique badge and other prizes!\n\nSeason Adventures\n* We're celebrating Christmas, and then we're off to France! With the Christmas and French Passes, you can win resources to develop and decorate your town!\n\nThrilling New Adventures\n* The Adventurers' Society is in danger! Can Richard, Rachel, and Zoe stop the villain?\n* A walk in the mountains turns into a rescue mission for Richard and Rachel in the middle of a raging blizzard!\n\n* Easy Navigation\nFilling orders just got easier! Tap the magnifying glass to go to the factory you need, and you'll automatically return to your orders when you close the window.\n\nAlso\n* A new match-3 element—Piñata!\n* A challenge on the northern seas in the new regatta season!\n* A new community building—Ice Arena!\"",
          "app_id": "638689075"
        },
        "Last War:Survival": {
          "version": "1.0.324",
          "updated": "2025-12-10T10:27:04Z",
          "releaseNotes": "1. Adjusted the rarity of the [5000 Diamond] item to UR (Gold).\n2. Optimized the text of some building descriptions in the Building List.",
          "app_id": "6448786147"
        },
        "Geometry Dash Lite": {
          "version": "2.21.6",
          "updated": "2024-12-20T15:20:54Z",
          "releaseNotes": "- New Level: Geometrical Dominator!\n- New Demon Level: Theory of Everything 2!\n- Collect Orbs to unlock items in the Shop.\n- Play the Daily Level and earn bonuses.\n- Weekly Demon and Event Levels now live!\n- New unique Levels every week!\n- Bonus platformer levels!\n- New Achievements and unlocks.\n- Daily chests, find secrets, bonuses and more!\n- Bugfixes and tweaks.",
          "app_id": "698255242"
        },
        "Whiteout Survival": {
          "version": "1.28.18",
          "updated": "2025-10-22T07:06:00Z",
          "releaseNotes": "[New Content]\n1. New Feature: Tundra Album. Forge your legend in the icy realm! Gather Scene Fragments scattered across the tundra. And piece them together into spectacular scenes. Relive the timeless legends of the frost-bound era and make history yourself!\n2. New Feature: Leading Glory system. Each time your state qualifies as a Leading State during State Transfer, it will receive a Leading Emblem. The Leading Emblems can be used to unlock exclusive rewards such as Sunfire Castle Shield Skin, State Transfer Event State Name Card, Sunfire Castle Skin and Turret Skin, and Exclusive State Title. Stay proud of your state!\n3. New Event: Dead Shot When participating in regular events, you have a chance of earning \"Shotchits\". You can use the \"Shotchits\" to play a shooting game. Hit the bullseye for bountiful rewards! Every 2 \"Chest Keys\" collected can be used to open a chest that contains extra bonuses. By spending enough Shotchits, you can unlock the exclusive Action Emote: Hit!\n\n[Optimization & Adjustment]\n1. Bear Hunt: Added the Auto-Register feature, which automatically starts a Bear Hunt based on the last opening time once the cooldown ends.\n2. Castle Battle: Reduced the battle duration to 5 hours and the required occupation time for victory to 2.5 hours, without changing the battlefield opening hours.\n3. Daybreak Island: Added a new basic decoration, \"Marble Fence\". Introduced the Like History feature, allowing you to view likes from other Chiefs.\n4. Lighthouse Intel: Upon reaching Furnace Lv. 15 or VIP Lv. 5, you will unlock the \"Claim All\" feature for claiming your Intel rewards.\n5. Alliance Championship: Added the \"Batch-Adjust\" feature to the troop info page, allowing R4 or higher officers to adjust lanes more efficiently.\n6. Teleport: While using a \"Territory Teleporter\", you can freely adjust and select your target location before confirmation. If your target location is within your Alliance territory, \"Territory Teleporters\" will be used first.\n7. Snowbusters:\na. Increased Fuel consumption and rewards for snow clearing (numerical adjustments only without changing the overall rewards). After a certain levels, monsters in an area can drop multiple Snowbuster Maps.\nb. Added a feature that allows you to exchange Fuel for Rockets after clearing Area 16.\nc. Added the Raid feature, which becomes available once you reach Area 24. You will be able to clear stages quickly by spending Fuel.\nd. Snowbusters Pass Optimization: Using Rockets now grants Snow Points. \n8. Chief Gear: When your state age reaches a certain number of days, we will introduce T4 Legendary Gear (3-Star) and expand the sources for Chief Gear enhancement materials. The details are as follows:\na. Labyrinth Shop: \"Chief Gear Materials Chest\" will become available.\nb. Alliance Championship Shop: The weekly purchase limit for \"Polishing Solution\", \"Design Plan\", and \"Hardened Alloy\" will be increased.\nc. Crazy Joe: Personal Ranking Rewards and Alliance Ranking Rewards will be updated.\n9. Frostdragon Tyrant: Introduced State Rewards for all Chiefs at Furnace Lv. 20 or higher in the states of the top 10 Chiefs on the Occupation Ranking. Additionally, the Tyrant’s Gift will now appear at a random location near the Sunfire Castle instead of a fixed position.\n10. Tundra Arms League: Introduced rank-determined State Rewards for all Chiefs at Furnace Lv. 20 or higher in the states of the top 4 Legions, which can be claimed manually.\n11. Foundry Battle: After occupying a building for 30 minutes in Foundry Battle and Tundra Arms League, you will gain Personal Points much faster.\n12. Mercenary Prestige: When your state unlocks Fire Crystal Lv. 8, a new type of Legend's Initiation will be introduced, and the current one will be renamed as Epic Initiation.\n13. The Labyrinth: Introduced the Alliance Member Leaderboard, allowing you to view your allies' performances.",
          "app_id": "6443575749"
        },
        "Gossip Harbor®: Merge & Story": {
          "version": "3.79.0",
          "updated": "2025-12-03T02:21:14Z",
          "releaseNotes": "NEW EPISODE EVERY FRIDAY!\n- NEW EPISODE: With new chapter updates every Friday; follow Quinn as she exposes secrets and solves puzzles.\n- NEW EVENT:Visit Hollybell Hollow to experience the snowglobe festival and unlock the Fraser Fir Lodge! Join Sam, Mark, and Quinn as they explore a quaint arctic village. Explore by collecting points and unlock exclusive decorations to complete the event.",
          "app_id": "1623318294"
        },
        "Word Search Explorer®": {
          "version": "1.126",
          "updated": "2025-12-13T11:11:42Z",
          "releaseNotes": "Bug fixes and performance boosts! Enjoy smoother gameplay and faster load times—dive right in!",
          "app_id": "1602508478"
        },
        "Among Us!": {
          "version": "2025.12.11",
          "updated": "2025-12-11T17:51:18Z",
          "releaseNotes": "Bug fixes",
          "app_id": "1351168404"
        },
        "Magic Tiles 3: Piano Game": {
          "version": "12.121.004",
          "updated": "2025-12-12T03:28:33Z",
          "releaseNotes": "We regularly update the game to enhance your experience! Don’t forget to update and enjoy the latest improvements. Stay connected with us on TikTok, YouTube, Facebook, and Instagram @magictiles3.",
          "app_id": "1443446174"
        },
        "Epic Plane Evolution": {
          "version": "1.6.38",
          "updated": "2025-12-02T23:04:38Z",
          "releaseNotes": "Bug fixes",
          "app_id": "6504122823"
        },
        "Heads Up!": {
          "version": "5.1.122",
          "updated": "2025-12-01T21:41:12Z",
          "releaseNotes": "How do you throw an amazing winter party? Invite all the cool kids!\n\nUpdates\n\n• This version includes content and cosmetic updates for our Winter event.\n• 'Tis the season. Grab some hot cocoa and enjoy a round of laughter with \"Act It Out\", \"Holiday Songs\", \"Holiday Movies\", and more!\n• Get a limited edition snowflake-themed card background with our holiday decks.\n\nPlease update your game for the latest content. Happy Playing!",
          "app_id": "623592465"
        },
        "Call of Duty®: Mobile": {
          "version": "1.0.53",
          "updated": "2025-12-08T03:15:30Z",
          "releaseNotes": "Call of Duty®: Mobile Season 11: 6th Anniversary is here! It’s our party—lock and load! Jump into DMZ: Recon, clash with the Street Fighter 6 content, and celebrate the fight that never ends. \n\nDMZ: Recon \nEnter DMZ: Recon, where every run is a test of instinct and endurance. Build your loadout, complete objectives, and battle hostiles and rival squads for valuable loot. Push deeper with every extraction to stack rewards, upgrade your gear, and dominate the battlefield. In DMZ: Recon, every player shapes their own path — adapt, outplay, and own every run. \n\nStreet Fighter 6 x CODM \nNew challengers have entered the fight in CODM! Suit up as Operators inspired by Chun-Li, Akuma, Ryu, and Cammy, each bringing signature finishers, emotes, and themed weapons to the fight. Complete the collection to wield the SMRS – Hadouken, Ryu’s legendary move reimagined for CODM. \n\nPlay to unlock even more Street Fighter 6 content — Demir – Luke and unique rewards await in the Secret Cache. \n\n6th Anniversary \nAnother year in the books, and CODM keeps evolving. Celebrate with us — vote for your favorite skins, take part in anniversary events, and discover Serpent Island in DMZ: Recon, where the party (and the cake) await. \n\nDouble COD Points \nEarn 2X COD Points when you buy now! Stock up in-game while the deal lasts and claim your favorite Street Fighter 6 content. Don’t wait — this offer ends January 19 (UTC)! \n\nSecret Cache Legendary Refresh \nAlongside the Street Fighter 6 rewards arriving in the Secret Cache, a new Legendary is dropping! Unlock the Striker – Source Code and erase your enemies into the digital abyss. \n\nNEW BATTLE PASSES \n’Tis the season to suit up with your favorite holiday Operators! The Season 11 Battle Pass is packed with winter-wonderland rewards to get you in the spirit. Earn free gear like the new SO-14 Marksman Rifle, or go Premium to unlock Ajax – Muay Claus. Naughty or nice, every tier’s a gift worth unwrapping! \n\nNEW BATTLE PASS VAULTS \nSix years strong, and the journey continues! Over time, we’ve delivered some unforgettable Battle Passes, and in Season 11, we’re unlocking the Vault to bring back three fan-favorite classics: New Order (2021), HEIST (2022), and Siren Song (2023). Grab them before they’re gone—and stay tuned. The road to 7 years has even more favorites waiting to return. \n\nThis season, we’re raising the bar — so celebrate with us as we take Call of Duty: Mobile to the next level and beyond. Here’s to six years of action… and the fight ahead!",
          "app_id": "1287282214"
        },
        "MONOPOLY GO!": {
          "version": "1.60.0",
          "updated": "2025-12-11T11:26:38Z",
          "releaseNotes": "The Harry Potter GO! Album has arrived, let the magic begin!\nExplore a magical themed board\nPlay the Snitch Chase for special rewards\nEarn Chocolate Frogs and collect enchanting Stickers\nJoin the Quidditch Racers event and ride your broomstick to victory!\nUpdate now and start collecting the magic!",
          "app_id": "1621328561"
        },
        "Subway Surfers": {
          "version": "3.56.0",
          "updated": "2025-12-08T07:53:38Z",
          "releaseNotes": "- The Crew is heading to the North Pole for a frosty holiday: are you Nice or Naughty?\n- Glide across candy-cane tracks under the northern lights and meet Jake in his festive Jester Outfit.\n- Complete seasonal Challenges to unlock festive Outfits for the whole Crew: discover Endearing Tricky, Yutani Gift Grifter and Fresh’s new Snow look.\n- Collect presents, ride sleighs and celebrate the season your way - Whether you are spreading cheer or stirring up mischief!",
          "app_id": "512939461"
        },
        "Yarn Fever! Unravel Puzzle": {
          "version": "7.1",
          "updated": "2025-12-12T01:07:08Z",
          "releaseNotes": "- Some bugs fixed!",
          "app_id": "6747875092"
        },
        "Color Blaze Shooter": {
          "version": "1.1.2",
          "updated": "2025-12-09T22:06:43Z",
          "releaseNotes": "improve performance\nupdate level",
          "app_id": "6754384144"
        },
        "Hexa Away": {
          "version": "3.1.1",
          "updated": "2025-12-04T06:57:43Z",
          "releaseNotes": "New stage gimmicks added!\nChallenge yourself with fresh, never-before-seen puzzle levels!",
          "app_id": "6504324020"
        },
        "Kingshot": {
          "version": "1.7.12",
          "updated": "2025-10-28T07:10:55Z",
          "releaseNotes": "[New Content]\n1. New Feature: Mystic Trial. A brand-new adventure awaits! \n2. New Feature: Leading Glory. During Kingdom Transfer, your Kingdom will receive a Leading Emblem each time it qualifies as a Leading Kingdom. Accumulate Leading Emblems to unlock special Leading Glory skins. Show off your Kingdom's dominance!\n3. New Feature: Mood Status. Set a status to let others know how you're feeling, making social interactions more fun and personal.",
          "app_id": "6739554056"
        },
        "Tasty Travels: Merge Game": {
          "version": "44.0",
          "updated": "2025-12-10T09:27:46Z",
          "releaseNotes": "- Minor bug fixes and improvements",
          "app_id": "6471045672"
        },
        "Happy Color by Numbers Game": {
          "version": "1.19.3",
          "updated": "2025-11-12T13:07:00Z",
          "releaseNotes": "• The \"Unexpected Things\" collection: unique, surprising, and unusual pictures by an anonymous artist that will captivate you and ignite your creativity!",
          "app_id": "1407852246"
        },
        "BLEACH Soul Resonance": {
          "version": "1.0.1",
          "updated": "2025-11-27T05:11:23Z",
          "releaseNotes": "Build update to address\n- An issue when in rare cases, starting the game on Wifi will not start the game.\n- An issue where some notification text is not localized.",
          "app_id": "6751220183"
        },
        "Goods Puzzle: Sort Challenge": {
          "version": "4.58",
          "updated": "2025-12-13T11:42:14Z",
          "releaseNotes": "- New event: Christmas",
          "app_id": "6482849843"
        },
        "That’s My Seat – Logic Puzzle": {
          "version": "1.9.3",
          "updated": "2025-12-10T11:57:35Z",
          "releaseNotes": "A huge update just dropped in That's My Seat! Here's what's new:\n- Monthly Events with fun mini-games and special prizes\n- New characters and celebrity-inspired cameos\n- Smoother gameplay and faster loading\n- New leaderboard season with exclusive rewards\n\nPlease keep your game updated for the best experience!\nNeed support? Contact us at \"contact-tms@maglab.com.tr\".",
          "app_id": "6532601126"
        },
        "My Supermarket Simulator 3D®": {
          "version": "1.24.2",
          "updated": "2025-12-12T11:36:47Z",
          "releaseNotes": "New Content & Performance Fix:\n\n- Added an adorable Cat Animation in Manager’s Pass decor item.\n- Fixed the issue where Customer Stuck at Shop entrance.\n- Other Minor Bugs Fixes\n\nMore exciting updates are on the way, stay tuned!",
          "app_id": "6511238101"
        },
        "Imposter Game — Fakeit": {
          "version": "1.4.9",
          "updated": "2025-12-10T23:39:39Z",
          "releaseNotes": "Minor improvements for a smoother experience",
          "app_id": "6749012623"
        },
        "Hole.io": {
          "version": "2.36.9",
          "updated": "2025-12-10T10:20:34Z",
          "releaseNotes": "Bug fixes & Technical improvements",
          "app_id": "1389111413"
        },
        "Disney Solitaire": {
          "version": "1.10.2",
          "updated": "2025-12-10T10:46:54Z",
          "releaseNotes": "Get ready for an amazing update!\n* Prepare for NEW levels!\n* Unlock NEW Disney characters!\n* Join the magic with NEW DISNEY FEATURES!\n* Enjoy performance improvements for a smoother gaming experience!\nPlay Disney Solitaire!",
          "app_id": "6475757306"
        },
        "Royal Match": {
          "version": "32672",
          "updated": "2025-12-08T08:00:23Z",
          "releaseNotes": "Are you ready for a challenging new update?\n\n• Get ready for amazing 100 NEW LEVELS! Fun and exciting new challenges are waiting for you!\n\n• Explore the NEW AREA! Open the doors to timeless elegance in the ROYAL WARDROBE!\n\nNew levels are coming in every two weeks! Be sure to update your game to get the latest content!",
          "app_id": "1482155847"
        },
        "Triumph: Play for Cash": {
          "version": "2.87.1",
          "updated": "2025-12-12T23:35:29Z",
          "releaseNotes": "Bug fixes and performance improvements.",
          "app_id": "1608987929"
        },
        "Coin Sort": {
          "version": "2.6.3",
          "updated": "2025-11-17T06:50:57Z",
          "releaseNotes": "Bug Fixes and Optimizations. Thank you for playing Coin Sort!",
          "app_id": "6446354191"
        },
        "Royal Kingdom": {
          "version": "23943",
          "updated": "2025-12-01T08:00:50Z",
          "releaseNotes": "Get ready for a shiny new update!\n\n• Prepare yourself for 100 NEW LEVELS! Experience fun and exciting challenges!\n\n• Explore the new district, LOTUS GARDEN! Keep expanding the kingdom to discover new horizons!\n\nPlay Royal Kingdom now!",
          "app_id": "1606549505"
        },
        "Wool Crush -Escape Traffic Jam": {
          "version": "2.9",
          "updated": "2025-12-05T01:23:34Z",
          "releaseNotes": "‌New enhanced features added! Experience the upgraded peripherals now!",
          "app_id": "6743385713"
        },
        "Arrows – Puzzle Escape": {
          "version": "0.8.0",
          "updated": "2025-12-02T19:17:24Z",
          "releaseNotes": "- Added languages support  \n\nThanks for playing!",
          "app_id": "6748397500"
        },
        "Jigblock™ Puzzle": {
          "version": "2.4.6",
          "updated": "2025-12-06T09:32:57Z",
          "releaseNotes": "Fix Bugs: some images missing in daily Challenge;",
          "app_id": "6747734279"
        },
        "Last Z: Survival Shooter": {
          "version": "1.250.688",
          "updated": "2025-12-10T15:30:49Z",
          "releaseNotes": "fix bug",
          "app_id": "6503272652"
        },
        "Meta Horizon": {
          "version": "349.2",
          "updated": "2025-12-11T23:34:34Z",
          "releaseNotes": "- Bug fixes and performance improvements.",
          "app_id": "1366478176"
        },
        "8 Ball Pool™": {
          "version": "56.16.1",
          "updated": "2025-12-02T09:50:01Z",
          "releaseNotes": "- Experiment the new and exciting Club Quests\n- You can now search, filter, and sort your Cues!\n\nBe on the lookout for the next exciting new events:\nNovember 20 - Angry Birds Season - Special Collaboration\nDecember 10 - Season of Seasons\n\nUpdate 8 Ball Pool to try it now!",
          "app_id": "543186831"
        },
        "Life Sim 3D: Family Simulator": {
          "version": "2.1.0",
          "updated": "2025-11-04T20:59:24Z",
          "releaseNotes": "Thanks for playing Life Sim! This update brings performance improvements and bug fixes. Enjoying the game? Please leave a five-star review—your feedback really helps!",
          "app_id": "6747178992"
        },
        "Lavish Luck Casino": {
          "version": "2.1",
          "updated": "2025-11-21T01:55:17Z",
          "releaseNotes": "Social media Login\nMinor Bug fixed",
          "app_id": "6738905436"
        },
        "Clash of Clans": {
          "version": "18.0.5",
          "updated": "2025-11-24T11:32:09Z",
          "releaseNotes": "Town Hall 18 Crash Lands!\n· Town Hall 18 makes an impact! Guardians are here to revolutionize your defense setup!\n· The Revenge Tower and Super Wizard Tower are a duo of delightful new defenses.\n· Crafting Phase 2 is here! Enjoy new Crafted Defenses: Hero Bell, Bomb Hive, and Light Beam.\n· The Fancy Shop opens for business! Earn Sparky Stones for upgrading Crafted Defenses and Supercharging buildings to unlock unique rewards.",
          "app_id": "529479190"
        }
      }
    }
  },
  "TW": {
    "ios": {
      "top_grossing": {
        "寒霜啟示錄": {
          "version": "1.28.18",
          "updated": "2025-10-22T07:06:00Z",
          "releaseNotes": "[New Content]\n1. New Feature: Tundra Album. Forge your legend in the icy realm! Gather Scene Fragments scattered across the tundra. And piece them together into spectacular scenes. Relive the timeless legends of the frost-bound era and make history yourself!\n2. New Feature: Leading Glory system. Each time your state qualifies as a Leading State during State Transfer, it will receive a Leading Emblem. The Leading Emblems can be used to unlock exclusive rewards such as Sunfire Castle Shield Skin, State Transfer Event State Name Card, Sunfire Castle Skin and Turret Skin, and Exclusive State Title. Stay proud of your state!\n3. New Event: Dead Shot When participating in regular events, you have a chance of earning \"Shotchits\". You can use the \"Shotchits\" to play a shooting game. Hit the bullseye for bountiful rewards! Every 2 \"Chest Keys\" collected can be used to open a chest that contains extra bonuses. By spending enough Shotchits, you can unlock the exclusive Action Emote: Hit!\n\n[Optimization & Adjustment]\n1. Bear Hunt: Added the Auto-Register feature, which automatically starts a Bear Hunt based on the last opening time once the cooldown ends.\n2. Castle Battle: Reduced the battle duration to 5 hours and the required occupation time for victory to 2.5 hours, without changing the battlefield opening hours.\n3. Daybreak Island: Added a new basic decoration, \"Marble Fence\". Introduced the Like History feature, allowing you to view likes from other Chiefs.\n4. Lighthouse Intel: Upon reaching Furnace Lv. 15 or VIP Lv. 5, you will unlock the \"Claim All\" feature for claiming your Intel rewards.\n5. Alliance Championship: Added the \"Batch-Adjust\" feature to the troop info page, allowing R4 or higher officers to adjust lanes more efficiently.\n6. Teleport: While using a \"Territory Teleporter\", you can freely adjust and select your target location before confirmation. If your target location is within your Alliance territory, \"Territory Teleporters\" will be used first.\n7. Snowbusters:\na. Increased Fuel consumption and rewards for snow clearing (numerical adjustments only without changing the overall rewards). After a certain levels, monsters in an area can drop multiple Snowbuster Maps.\nb. Added a feature that allows you to exchange Fuel for Rockets after clearing Area 16.\nc. Added the Raid feature, which becomes available once you reach Area 24. You will be able to clear stages quickly by spending Fuel.\nd. Snowbusters Pass Optimization: Using Rockets now grants Snow Points. \n8. Chief Gear: When your state age reaches a certain number of days, we will introduce T4 Legendary Gear (3-Star) and expand the sources for Chief Gear enhancement materials. The details are as follows:\na. Labyrinth Shop: \"Chief Gear Materials Chest\" will become available.\nb. Alliance Championship Shop: The weekly purchase limit for \"Polishing Solution\", \"Design Plan\", and \"Hardened Alloy\" will be increased.\nc. Crazy Joe: Personal Ranking Rewards and Alliance Ranking Rewards will be updated.\n9. Frostdragon Tyrant: Introduced State Rewards for all Chiefs at Furnace Lv. 20 or higher in the states of the top 10 Chiefs on the Occupation Ranking. Additionally, the Tyrant’s Gift will now appear at a random location near the Sunfire Castle instead of a fixed position.\n10. Tundra Arms League: Introduced rank-determined State Rewards for all Chiefs at Furnace Lv. 20 or higher in the states of the top 4 Legions, which can be claimed manually.\n11. Foundry Battle: After occupying a building for 30 minutes in Foundry Battle and Tundra Arms League, you will gain Personal Points much faster.\n12. Mercenary Prestige: When your state unlocks Fire Crystal Lv. 8, a new type of Legend's Initiation will be introduced, and the current one will be renamed as Epic Initiation.\n13. The Labyrinth: Introduced the Alliance Member Leaderboard, allowing you to view your allies' performances.",
          "app_id": "6443575749"
        },
        "最後的戰爭 - Last War": {
          "version": "1.0.324",
          "updated": "2025-12-10T10:27:04Z",
          "releaseNotes": "1. Adjusted the rarity of the [5000 Diamond] item to UR (Gold).\n2. Optimized the text of some building descriptions in the Building List.",
          "app_id": "6448786147"
        },
        "楓之谷：放置冒險記": {
          "version": "1.2.0",
          "updated": "2025-11-26T19:17:24Z",
          "releaseNotes": "▶ New Party Quest: Dimensional Crack\n▶ Guild War added\n▶ New event added",
          "app_id": "6739616715"
        },
        "星城Online-普發一萬現領現玩": {
          "version": "6.53",
          "updated": "2025-12-11T00:36:19Z",
          "releaseNotes": "【神鬼奧丁】神殿開啟爽加局~奧丁之眼累倍無限！\n【任務通行證】調整獎勵內容",
          "app_id": "919043762"
        },
        "Kingshot": {
          "version": "1.7.12",
          "updated": "2025-10-28T07:10:55Z",
          "releaseNotes": "[New Content]\n1. New Feature: Mystic Trial. A brand-new adventure awaits! \n2. New Feature: Leading Glory. During Kingdom Transfer, your Kingdom will receive a Leading Emblem each time it qualifies as a Leading Kingdom. Accumulate Leading Emblems to unlock special Leading Glory skins. Show off your Kingdom's dominance!\n3. New Feature: Mood Status. Set a status to let others know how you're feeling, making social interactions more fun and personal.",
          "app_id": "6739554056"
        },
        "麻將明星3缺1": {
          "version": "6.9.160",
          "updated": "2025-11-24T06:55:48Z",
          "releaseNotes": "【麻将至尊】一季一度的至尊赛，挑战巨额游戏币奖励与荣耀称号\n【操作优化】优化了炮塔找角色的一些方式\n【问题修正】修正一些小问题\n【功能新增】新增Game Center任务啰，赶紧来看看那些好朋友也有玩明星3缺1",
          "app_id": "501306812"
        },
        "Last Z:Survival Shooter（倖存者逃亡）": {
          "version": "1.250.688",
          "updated": "2025-12-10T15:30:49Z",
          "releaseNotes": "fix bug",
          "app_id": "6503272652"
        },
        "緋聞港口：合併&故事": {
          "version": "3.79.0",
          "updated": "2025-12-03T02:21:14Z",
          "releaseNotes": "NEW EPISODE EVERY FRIDAY!\n- NEW EPISODE: With new chapter updates every Friday; follow Quinn as she exposes secrets and solves puzzles.\n- NEW EVENT:Visit Hollybell Hollow to experience the snowglobe festival and unlock the Fraser Fir Lodge! Join Sam, Mark, and Quinn as they explore a quaint arctic village. Explore by collecting points and unlock exclusive decorations to complete the event.",
          "app_id": "1623318294"
        },
        "Dark War:Survival": {
          "version": "1.250.626",
          "updated": "2025-12-12T09:17:15Z",
          "releaseNotes": "[Main Screen]\n- Streamlined the World main interface to expand combat operation space: Removed the left sidebar. Troop information is now permanently displayed in the lower right corner.\n- Two new settings added under [Avatar → Settings → General Settings]: [Drag troop avatars on the main screen to control troops] and [Return button visibility next to troops]. Used to enable/disable troop control via dragging avatars and toggling the visibility of the return button next to troops.\n- Scout troops now display both march and return time.\n- Increased spacing between the 4 march queues on the right side to reduce accidental taps.\n- Added a [Rally] button to the left of the right-side march queues for quick access to the rally interface.\n- The rally prompt bubble no longer pops up at the bottom left of the main screen when eligible for auto-join rallies.\n- Removed the quick-jump bubble on Saturdays during the Alliance Duel [Enemy Buster].\n\n[MutaBeast Hunt]\n- After locating a MutaBeast, it will disappear if not defeated within 30 minutes. Survivors must search again (re-searching does not reset progress).\n- After the event starts, the event bubble at the bottom of the main interface will display the current hunt progress.\n\n[Chat]\n- Using the [Reply] function will now automatically @ the other survivor.\n- Tap the area above the reply box to see the original text, with translation available.\nYou can choose to add the survivor to your blacklist when reporting them.\n\n[Combat Experience]\n1. Experimental Feature\n- A new [Experimental Feature] buff will be active on the days when [Alliance Duel] Enemy Buster, [State of Supremacy], and [Capital Clash] events begin.\n- While the [Experimental Feature] buff is active, unit losses from attacking shelters will be reduced by 50%.\n- The [Experimental Feature] is currently in beta testing. We welcome survivors to share your honest feedback with us through [Support].\n\n2. World Battles\n- Improved the selection logic for shelter buildings on the World Map, making it easier to select a shelter when dragging troops.\n- Optimized the floating text display during combat, and hidden the floating text for buffs in battle.\n- Improved the burning visual effects on shelters when wall durability decreases.\n\n[Others]\n- In [Black Gold Battlefield], battle results for Team B will be sent to all alliance members after the fight ends.\n- [MutaBeast Hunt]\n- When promoting units, the number of remaining units at that level will now be displayed below the unit icon.\n- Optimized the visual presentation of the [Shadow Calls] event.\n- Adjusted the display image on the Hero Exclusive Equipment Pack interface to show the corresponding exclusive equipment.\n- Ruby-type items have been moved from the [Resources] tab to the [Special] tab in the inventory.\n- Survivors earn rewards each time they unlock a new section of the Apocalypse Guide.",
          "app_id": "6670441558"
        },
        "糖果傳奇": {
          "version": "1.317.1.2",
          "updated": "2025-12-09T07:14:52Z",
          "releaseNotes": "We hope you’re having fun playing Candy Crush Saga! \n\nWe update the game every week with sweet new features, exciting levels, and important bug fixes to keep everything running smoothly. \n\nDon't forget to download the latest version for the best experience!\n\nNew to the game? Don’t be shy, join the fun!",
          "app_id": "553834731"
        },
        "麻將 神來也麻將－台灣16張、麻雀": {
          "version": "19.1",
          "updated": "2025-11-27T05:57:52Z",
          "releaseNotes": "Improved gameplay.\n\nNote:\nIf you have trouble logging in or forgot your password, please click on \"Can't sign in\" on the login screen to send a report. We will immediately take care of the issue.\n\nGamesofa are constantly striving to improve the quality of our games. If you have any suggestions, please let us know using the customer feedback function so we can solve the problem. Thank you!",
          "app_id": "455902495"
        },
        "Coin Master": {
          "version": "3.5.2340",
          "updated": "2025-12-08T15:25:46Z",
          "releaseNotes": "Thanks for playing Coin Master!\n\nIn this version, we’ve implemented bug fixes & performance improvements.\n\nWe have also implemented our new reward calendar feature - collect your daily rewards! \n\nEnjoy a world of fun, thrills, and huge rewards right at your fingertips. \n\nInvite your friends to play Coin Master & get your FREE REWARDS! We also recommend joining our community on Facebook, Twitter, and Instagram for more fun & excitement.\n\nEnjoying Coin Master? Leave a review :)",
          "app_id": "406889139"
        },
        "鳴潮": {
          "version": "2.8.2",
          "updated": "2025-12-06T08:16:20Z",
          "releaseNotes": "Optimized some known performance issues on certain iOS devices.",
          "app_id": "6475033368"
        },
        "卡皮巴拉 Go!": {
          "version": "1.7.6",
          "updated": "2025-10-30T07:16:55Z",
          "releaseNotes": "[New Content] \n1. Add Portuguese (Brazil) multilingual option; \n[Optimization] \n1. Home experience optimization; \n[Bug Fixes] \n1. Fix the white screen issue with the Kapi Machine's grand prize probability display; 2. Fix the issue where the mount's skill counterattack does not trigger the light spear; 3. Fix the issue where online friends are not displayed when teaming up in the Gulu Dungeon",
          "app_id": "6596787726"
        },
        "王國之歌（Top Heroes）": {
          "version": "1.83.14",
          "updated": "2025-12-09T02:49:32Z",
          "releaseNotes": "A new Wyvern Racing event launches: lords can wield cards and wyverns to race opponents in high-speed duels, tearing through the clouds and cutting the wind, pushing past all limits — victors will return lauded as legends!",
          "app_id": "6450953550"
        },
        "滿貫大亨 - 快打旋風登場": {
          "version": "1.1.240",
          "updated": "2025-11-26T01:23:05Z",
          "releaseNotes": "《吉莉卡蛙》最新4POT玩法！三色FG全面升級！",
          "app_id": "1007924271"
        },
        "神魔之塔": {
          "version": "2025.611",
          "updated": "2025-12-05T02:59:18Z",
          "releaseNotes": "Some bugs fixed",
          "app_id": "583798880"
        },
        "夢幻花園 (Gardenscapes)": {
          "version": "9.2.2",
          "updated": "2025-11-27T19:45:27Z",
          "releaseNotes": "An intriguing Gardenscapes update!\nNEW EVENTS\nA Puzzling Inheritance: Uncover the secret of the family heirlooms and find Mycroft's treasure!\nChristmas with the Parents: Help Katherine and Austin reach a mountain lodge in time for Christmas!\n\nSTORYLINE\nFind out if Austin and friends can solve the mystery of the truth serum!",
          "app_id": "1105855019"
        },
        "貓咪大戰爭": {
          "version": "15.0.0",
          "updated": "2025-12-08T02:00:20Z",
          "releaseNotes": "■改善「不死生物來襲」活動\n畫面中會顯示出現不死生物的關卡名稱以及剩餘時間。\n另外也提升了尚未過關的不死生物關卡之出現機率。\n※玩家通過「世界篇」、「未來篇」和「宇宙篇」的各章後，就會出現該章的「不死生物來襲」活動。\n\n■追加角色的進化型態\n　追加了部份角色的第4進化\n\n■追加角色本能\n　追加了部份角色的本能、超本能\n\n■傳奇故事\n　追加新地圖\n　現有地圖解放關卡新高難易度\n\n■其他追加內容\n　追加等級排行報酬\n　追加貓咪聯組\n　改善部分遊戲功能\n\n■修正部分程式錯誤",
          "app_id": "971601423"
        },
        "弓箭傳說2": {
          "version": "1.1.3",
          "updated": "2025-10-22T12:30:13Z",
          "releaseNotes": "1. Lost Kingdom series heroes: Cleo, Phynx, Mymu, and their new Halloween skins \"Fiery Reckoning,\" \"Scarlet Sandstorm,\" and \"Empowered Curse.\"\n2. Halloween Special Event: Candy Carnival! Get the new Halloween-themed relics: Frostflame Lamp and Boltfang Candy Jar!\n3. Halloween Limited Brawl Mode: Trick-or-Treat Party!\n4. Guild Expedition will now be season-based, and the first season is about to officially begin!\n5. Optimized Arena Grouping for new servers.",
          "app_id": "6502820653"
        },
        "崩壞：星穹鐵道": {
          "version": "3.7.0",
          "updated": "2025-11-04T21:53:51Z",
          "releaseNotes": "The brand-new Version 3.7 \"As Tomorrow Became Yesterday\" is now online!\nNew Character: Cyrene (Remembrance: Ice)\nNew Story: Trailblaze Mission \"Amphoreus — As Tomorrow Became Yesterday\"\nNew Gameplay: Currency Wars: Zero-Sum Game\nNew Events: Snack Dash, Relic Recon\nVersion Benefits: Log in to get Golden Companion Spirit ×1! The limited 5-star character \"Topaz & Numby (The Hunt: Fire)\" is now available in the Exchange Shop!\nOther: New Trailblazer Outfit, New Cyrene appearance The Promise's \"∞\"",
          "app_id": "1599719154"
        },
        "MLB：9局職棒25": {
          "version": "10.1.3",
          "updated": "2025-11-27T01:59:38Z",
          "releaseNotes": "- Replaced Stadium Background during Auto Game.\n- Added Skill Trainer combination to Club Crafting.\n- Updated various QoL features.\n\nGot feedback? Leave a review or contact our Customer Support by visiting http://customer-m.withhive.com/ask",
          "app_id": "1059665257"
        },
        "Pokémon GO": {
          "version": "0.391.0",
          "updated": "2025-12-11T20:25:19Z",
          "releaseNotes": "Trainers, we hope you’re enjoying your adventure in Pokémon GO! We update the app regularly with new events and features, so make sure to check the in-game News to stay up to date.",
          "app_id": "1094591345"
        },
        "《荒野亂鬥》": {
          "version": "64.264",
          "updated": "2025-11-12T08:56:04Z",
          "releaseNotes": "UPDATE 64: STRANGER THINGS\nNovember 2025 - December 2025\n∙ Head into the Upside Showdown, a new rogue-lite PVP mode! Get unique powers every game, making each run different!\n∙ Stranger Things skins, like Eleven Lumi & Scoops Ahoy Berry!\n∙ New Brawler: Gigi (Mythic Assassin)\n∙ Brawlidays get MECHA!\n∙ Brawl Pass Season 44: Stranger Things (November)\n∙ Brawl Pass Season 45: Mechmas (December)",
          "app_id": "1229016807"
        },
        "Royal Match": {
          "version": "32672",
          "updated": "2025-12-08T08:00:23Z",
          "releaseNotes": "Are you ready for a challenging new update?\n\n• Get ready for amazing 100 NEW LEVELS! Fun and exciting new challenges are waiting for you!\n\n• Explore the NEW AREA! Open the doors to timeless elegance in the ROYAL WARDROBE!\n\nNew levels are coming in every two weeks! Be sure to update your game to get the latest content!",
          "app_id": "1482155847"
        },
        "大福Online-老虎機、捕魚、推幣機、刮刮樂、拉霸 娛樂城": {
          "version": "14.9",
          "updated": "2025-11-27T14:37:07Z",
          "releaseNotes": "Hey! NEW SLOT GAMES served!\nInstall to enjoy better experience and holiday events now!\n\n– NEW SLOT GAMES!\nBlazing Toro Bash, Raiders Of The Snowfield,  Big Sale Frenzy ...\n\n– IMPROVED EXPERIENCE!\nSeveral bugs have been fixed to provide better user experience!",
          "app_id": "1356980152"
        },
        "夢幻家園 (Homescapes)": {
          "version": "8.4.10",
          "updated": "2025-12-04T12:46:11Z",
          "releaseNotes": "A magical Homescapes update is here!\n\nSECRETS OF THE SCHOOL OF MAGIC\n• Go to the School of Magic with Austin and a young sorceress!\n• Save the magical world from sinister Dark Guardians!\n• Complete the event to get valuable rewards!\n\nA SHADOW OVER CHRISTMAS\n• Go on a Christmas adventure with Austin and his family!\n• Pass Krampus's trials to save the long-awaited holiday!\n• Complete the event to get valuable rewards!\n\nALSO\n• A new chapter: Broom Bakery! Will Stephanie Broom pull off opening the best café in town?",
          "app_id": "1195621598"
        },
        "七騎士 Re:BIRTH": {
          "version": "1.10.03",
          "updated": "2025-12-10T22:52:36Z",
          "releaseNotes": "[New Additions]\n- New Legendary Hero [Freyja] added\n- 7 New costumes added\n- New Story Event added\n- Adventurer Skill levels expanded\n\n[Improvements and Fixes]\n- Improved Content Convenience\n- Bug Fixes and Other Improvements",
          "app_id": "6479595079"
        }
      },
      "top_free": {
        "Block Blast!": {
          "version": "6.6.2",
          "updated": "2025-12-13T02:21:34Z",
          "releaseNotes": "We're always improving Block Blast! Turn on auto-updates to get the latest features.\nSuggestions? Email us: blockblast-support@hungrystudio.com\nFollow us on TikTok for updates: @blockblastofficial",
          "app_id": "1617391485"
        },
        "Pikmin Bloom": {
          "version": "134.0",
          "updated": "2025-12-08T08:07:32Z",
          "releaseNotes": "Thanks for playing Pikmin Bloom! New in this version:\n\n- Minor improvements and bug fixes.\n\n*Please download the latest version of the app from the store for the changes above to be reflected.",
          "app_id": "1556357398"
        },
        "楓之谷：放置冒險記": {
          "version": "1.2.0",
          "updated": "2025-11-26T19:17:24Z",
          "releaseNotes": "▶ New Party Quest: Dimensional Crack\n▶ Guild War added\n▶ New event added",
          "app_id": "6739616715"
        },
        "Kingshot": {
          "version": "1.7.12",
          "updated": "2025-10-28T07:10:55Z",
          "releaseNotes": "[New Content]\n1. New Feature: Mystic Trial. A brand-new adventure awaits! \n2. New Feature: Leading Glory. During Kingdom Transfer, your Kingdom will receive a Leading Emblem each time it qualifies as a Leading Kingdom. Accumulate Leading Emblems to unlock special Leading Glory skins. Show off your Kingdom's dominance!\n3. New Feature: Mood Status. Set a status to let others know how you're feeling, making social interactions more fun and personal.",
          "app_id": "6739554056"
        },
        "Foodie Sizzle: 美食滋滋": {
          "version": "1.56",
          "updated": "2025-12-13T04:32:30Z",
          "releaseNotes": "* Added new Foodie Puzzle event\n* Added new Xmas Offer\n* Performance optimization\n* Bug fixes",
          "app_id": "6746246179"
        },
        "Frost & Flame: King of Avalon": {
          "version": "22.8.0",
          "updated": "2025-12-10T03:38:34Z",
          "releaseNotes": "What's New:\n 1. T17 Angel Troops are coming!\n 2. The Alliance Showdown is coming soon!",
          "app_id": "1084930849"
        },
        "毛線衝擊 - Traffic Jam公車遊戲 塞車解謎": {
          "version": "2.9",
          "updated": "2025-12-05T01:23:34Z",
          "releaseNotes": "‌New enhanced features added! Experience the upgraded peripherals now!",
          "app_id": "6743385713"
        },
        "八零找茬": {
          "version": "1.0.8",
          "updated": "2025-10-16T01:21:17Z",
          "releaseNotes": "Optimize gameplay experience and fix game issues",
          "app_id": "6748932117"
        },
        "Bus Escape: Traffic Jam": {
          "version": "1.9.51",
          "updated": "2025-12-10T17:30:23Z",
          "releaseNotes": "-Update levels.",
          "app_id": "6689516366"
        },
        "Last Z:Survival Shooter（倖存者逃亡）": {
          "version": "1.250.688",
          "updated": "2025-12-10T15:30:49Z",
          "releaseNotes": "fix bug",
          "app_id": "6503272652"
        },
        "Roblox": {
          "version": "2.702.622",
          "updated": "2025-12-11T22:19:06Z",
          "releaseNotes": "To make Roblox work better for you, we deliver updates regularly. These updates include bug fixes and improvements for speed and reliability.",
          "app_id": "431946152"
        },
        "拼圖接龍": {
          "version": "1.0.0",
          "updated": "2025-11-28T02:39:14Z",
          "releaseNotes": "Thank you for playing Jigsolitaire!\nIn this update, we've upgraded our internal libraries to the latest versions, enhancing overall performance and stability. We've also made several small tweaks and minor fixes to ensure a smoother and more enjoyable gameplay experience.\nWe hope you continue to enjoy Jigsolitaire!",
          "app_id": "6741408932"
        },
        "腦洞大爆炸 - 詞語分類 單機益智文字遊戲": {
          "version": "2.1",
          "updated": "2025-12-13T01:34:50Z",
          "releaseNotes": "Optimized and adjusted current levels for smoother experience.",
          "app_id": "6751377873"
        },
        "寒霜啟示錄": {
          "version": "1.28.18",
          "updated": "2025-10-22T07:06:00Z",
          "releaseNotes": "[New Content]\n1. New Feature: Tundra Album. Forge your legend in the icy realm! Gather Scene Fragments scattered across the tundra. And piece them together into spectacular scenes. Relive the timeless legends of the frost-bound era and make history yourself!\n2. New Feature: Leading Glory system. Each time your state qualifies as a Leading State during State Transfer, it will receive a Leading Emblem. The Leading Emblems can be used to unlock exclusive rewards such as Sunfire Castle Shield Skin, State Transfer Event State Name Card, Sunfire Castle Skin and Turret Skin, and Exclusive State Title. Stay proud of your state!\n3. New Event: Dead Shot When participating in regular events, you have a chance of earning \"Shotchits\". You can use the \"Shotchits\" to play a shooting game. Hit the bullseye for bountiful rewards! Every 2 \"Chest Keys\" collected can be used to open a chest that contains extra bonuses. By spending enough Shotchits, you can unlock the exclusive Action Emote: Hit!\n\n[Optimization & Adjustment]\n1. Bear Hunt: Added the Auto-Register feature, which automatically starts a Bear Hunt based on the last opening time once the cooldown ends.\n2. Castle Battle: Reduced the battle duration to 5 hours and the required occupation time for victory to 2.5 hours, without changing the battlefield opening hours.\n3. Daybreak Island: Added a new basic decoration, \"Marble Fence\". Introduced the Like History feature, allowing you to view likes from other Chiefs.\n4. Lighthouse Intel: Upon reaching Furnace Lv. 15 or VIP Lv. 5, you will unlock the \"Claim All\" feature for claiming your Intel rewards.\n5. Alliance Championship: Added the \"Batch-Adjust\" feature to the troop info page, allowing R4 or higher officers to adjust lanes more efficiently.\n6. Teleport: While using a \"Territory Teleporter\", you can freely adjust and select your target location before confirmation. If your target location is within your Alliance territory, \"Territory Teleporters\" will be used first.\n7. Snowbusters:\na. Increased Fuel consumption and rewards for snow clearing (numerical adjustments only without changing the overall rewards). After a certain levels, monsters in an area can drop multiple Snowbuster Maps.\nb. Added a feature that allows you to exchange Fuel for Rockets after clearing Area 16.\nc. Added the Raid feature, which becomes available once you reach Area 24. You will be able to clear stages quickly by spending Fuel.\nd. Snowbusters Pass Optimization: Using Rockets now grants Snow Points. \n8. Chief Gear: When your state age reaches a certain number of days, we will introduce T4 Legendary Gear (3-Star) and expand the sources for Chief Gear enhancement materials. The details are as follows:\na. Labyrinth Shop: \"Chief Gear Materials Chest\" will become available.\nb. Alliance Championship Shop: The weekly purchase limit for \"Polishing Solution\", \"Design Plan\", and \"Hardened Alloy\" will be increased.\nc. Crazy Joe: Personal Ranking Rewards and Alliance Ranking Rewards will be updated.\n9. Frostdragon Tyrant: Introduced State Rewards for all Chiefs at Furnace Lv. 20 or higher in the states of the top 10 Chiefs on the Occupation Ranking. Additionally, the Tyrant’s Gift will now appear at a random location near the Sunfire Castle instead of a fixed position.\n10. Tundra Arms League: Introduced rank-determined State Rewards for all Chiefs at Furnace Lv. 20 or higher in the states of the top 4 Legions, which can be claimed manually.\n11. Foundry Battle: After occupying a building for 30 minutes in Foundry Battle and Tundra Arms League, you will gain Personal Points much faster.\n12. Mercenary Prestige: When your state unlocks Fire Crystal Lv. 8, a new type of Legend's Initiation will be introduced, and the current one will be renamed as Epic Initiation.\n13. The Labyrinth: Introduced the Alliance Member Leaderboard, allowing you to view your allies' performances.",
          "app_id": "6443575749"
        },
        "墓園塔防戰": {
          "version": "0.7282",
          "updated": "2025-12-09T04:37:53Z",
          "releaseNotes": "- Convenience Improvements",
          "app_id": "6738600584"
        },
        "細胞保衛戰 - 生存射擊大亂鬥": {
          "version": "2.3",
          "updated": "2025-12-11T08:39:22Z",
          "releaseNotes": "Stability improvements and bug fixes.",
          "app_id": "6746465127"
        },
        "食光旅行": {
          "version": "44.0",
          "updated": "2025-12-10T09:27:46Z",
          "releaseNotes": "- Minor bug fixes and improvements",
          "app_id": "6471045672"
        },
        "單線方塊填充益智遊戲": {
          "version": "1.0.6",
          "updated": "2025-12-03T18:28:54Z",
          "releaseNotes": "Optimized Game Experience",
          "app_id": "6748683699"
        },
        "最後的戰爭 - Last War": {
          "version": "1.0.324",
          "updated": "2025-12-10T10:27:04Z",
          "releaseNotes": "1. Adjusted the rarity of the [5000 Diamond] item to UR (Gold).\n2. Optimized the text of some building descriptions in the Building List.",
          "app_id": "6448786147"
        },
        "Match Villains": {
          "version": "1.42.0",
          "updated": "2025-12-08T08:00:12Z",
          "releaseNotes": "City lights, high speed nights. 100 new levels await!\n\nNEW ITEM: HEXAWALL! A glowing hex wall drops in. Keep hitting, keep revealing what is hidden underneath.\n\nNEW EVENT: SAFE CRACKERS: THANKSGIVING! Cozy safes, big rewards. Crack them open and unlock a brand new Thanksgiving style.\n\nNEW POSTER: RUSH HOUR! Fresh off their latest act, Luna, Frank, and Viktor hit the streets at full speed. Sirens roar and the chase is on.\n\nStay sharp, Villains!",
          "app_id": "6479752688"
        },
        "緋聞港口：合併&故事": {
          "version": "3.79.0",
          "updated": "2025-12-03T02:21:14Z",
          "releaseNotes": "NEW EPISODE EVERY FRIDAY!\n- NEW EPISODE: With new chapter updates every Friday; follow Quinn as she exposes secrets and solves puzzles.\n- NEW EVENT:Visit Hollybell Hollow to experience the snowglobe festival and unlock the Fraser Fir Lodge! Join Sam, Mark, and Quinn as they explore a quaint arctic village. Explore by collecting points and unlock exclusive decorations to complete the event.",
          "app_id": "1623318294"
        },
        "卡厄思夢境": {
          "version": "1.0.228",
          "updated": "2025-12-03T02:29:56Z",
          "releaseNotes": "New Combatant: Chizuru\nNew Partner: Itsuku\nNew Content: Basin of Hyperspace Season 3 (Dimensional Twilight)\nNew System: Messenger\n\nGalactic Disaster Season 1 Chapter 2 (Main Story Chapter 7) Story\nGalactic Disaster: The Great Rift (First Half)\nGalactic Disaster: 2nd Supply Store Open\n\nNew Events & Bug Fixes",
          "app_id": "6502326151"
        },
        "貓咪掉下去": {
          "version": "1.10.57",
          "updated": "2025-12-12T09:22:18Z",
          "releaseNotes": "-stage added\n-SeasonPass Updated\n-performance improved",
          "app_id": "6749132002"
        },
        "Block Puzzle Solver for Blast!": {
          "version": "1.1.10",
          "updated": "2025-10-30T12:57:37Z",
          "releaseNotes": "Fix issues;\nImprove experience.",
          "app_id": "6738498827"
        },
        "Grill Sort - 燒烤時光 物品分類遊戲": {
          "version": "3.4",
          "updated": "2025-12-13T11:17:09Z",
          "releaseNotes": "Practical improvements! More reasonable levels!",
          "app_id": "6742812903"
        },
        "鳴潮": {
          "version": "2.8.2",
          "updated": "2025-12-06T08:16:20Z",
          "releaseNotes": "Optimized some known performance issues on certain iOS devices.",
          "app_id": "6475033368"
        },
        "不用網路的遊戲 - 無網路遊戲 - 離線 遊戲 - 無網遊戲": {
          "version": "3.5.1",
          "updated": "2025-11-11T21:53:17Z",
          "releaseNotes": "• New game: Spades\n• New pool controls in settings\n• Bug fixes and improvements",
          "app_id": "6448104157"
        },
        "齒輪獸衛隊": {
          "version": "0.9.0",
          "updated": "2025-12-08T02:04:34Z",
          "releaseNotes": "1. Added World/Guild Chat.\n2. Multiple display and interaction optimizations for Guild, Arena, and Sacred Tree Expedition.",
          "app_id": "6747024269"
        },
        "Brain Puzzle: Tricky Quest": {
          "version": "1.3.1",
          "updated": "2025-12-02T21:52:05Z",
          "releaseNotes": "add new levels",
          "app_id": "6670789598"
        }
      }
    }
  }
}